{
  "metadata": {
    "category": "networking",
    "source_file": "expert_training_data_20250904_014617",
    "processed_at": "2025-09-04T02:42:17.154829",
    "total_cases": 2,
    "organization_system": "OpenGenNet AI Expert Knowledge Organizer"
  },
  "expert_cases": [
    {
      "case_id": "EXPERT_NET_001",
      "title": "Expert Knowledge: BGP Protocol | Border Gateway Protocol | Autonomous Systems ⋆",
      "category": "BGP",
      "technology": "BGP Routing Protocol",
      "description": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Mult...",
      "full_content": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Multicast Course SDN Course Video Courses CCNA 200-301 Labs HCIA Configuration Course NRS I Configuration Course CCNP 350-401 ENCOR Labs Cisco Packet Tracer How To Guide Online Courses Udemy Courses SPECIALS All Quizes CCNA Flashcard Questions Cheat Sheets Protocol Cheat Sheets Subnetting Cheat Sheet Linux Cheat Sheet Python Cheat Sheet CLI Commands Cheat Sheets Miscellaneous Cheat Sheets Network Labs Cisco Packet Tracer Labs Cisco GNS3 Labs Huawei eNSP Labs Nokia GNS3 Labs Short Config Videos Network Tools IPCisco on Social Media Network Engineer Interview Questions Personality Interview Training BLOG MEMBERS Sign In/Up | Members Lost password Sign In/Sign Up SHOP ABOUT About Contact References Donation ENROLL HERE Table of Contents Toggle What is BGP Protocol? There are different routing protocols used in networking. In this BGP Tutorial, we will focus on the protocol of Internet, BGP. Commonly, we can divide these routing protocols into two types according to the place that we use them. These routing protocols are IGP (Interior Gateway Protocols) and EGP (Exterior Gateway Protocols). If we use a routing protocol inside of our network, it is IGP. If we use them outside of our network, it is EGP. In the previous lessons, we have talked about different IGPs. In this lesson, we will talk about the only EGP used today. This is the protocol of Internet, BGP Protocol, Border Gateway Protocol. By the way, here we will focus on the overview of Border Gateway Protocol. We will focus on advanced lessons like BGP Communities, BGP Filtering, BGP Convergence on the related lessons. Border Gateway Protocol (BGP) was developed by IETF (Internet Engineering Task Force). It is known as the global routing protocol of Internet today. Because BGP routes the traffic across internet and between different service providers. It is the most scalable routing protocol today. Why We Use BGP? BGP is mainly a routing protocol. Here, you can think about that, why can’t we use other routing protocols over internet? Why we need BGP on Internet? The answer of this question is the importance of the BGP. Let’s explain deeply. Internet is a large network and consist of many organizations. For such large networks, redundancy and load balancing is very important. For example, a large organization can need one more internet connection with different Public IP addresses. Another one can have one more connection and wants to use one link more than others with load balancing. These detailed services cannot be done easily by a routing protocol. Border Gateway Protocol overcomes these issues by itself. We can use redundancy and load balancing services effectively with BGP. To do this, we have a high control over BGP path selection. We can use different BGP Path attributes to manipulate path selection. With this manipulation, optimum path and traffic policy for an organization is determined. Basically, BGP is responsible to determine the optimum path and by hoping between autonomous systems, it delivers the required data across Internet. What was the main difference between an IGP and an EGP? Well known IGPS are RIP, OSPF, EIGRP, IS-IS. These routing protocols give us the ability to route the traffic within an Autonomous System. In other words, we use IGPs inside our network but it is not feasible to use these protocols on a large network like Internet. But EGP allow us to route the traffic between ASs (Autonomous Systems). BGP is an Exterior Gateway Protocol (EGP). BGP routes the Internet traffic between Autonomous Systems. We can say that, internet is the collection of connected ASs. So, BGP is also known as Internet Protocol. You can test your BGP Knowledge on BGP Practice Tests Page! There are many corporates like Cisco, Huawei, Juniper and Nokia on internet and they have their own AS numbers. And internet is collection of these Autonomous Systems. Internet Consist of Autonomous Systems So, what is an Autonomous System? What is ASN? What is Autonomous System (AS) & AS Number (ASN)? An Autonomous System (AS) is a network or a collection of networks that are under a single entity or organization management. And the Internet is the collection of ASs. Service Providers and large companies has their own Autonomous Systems and they are known with their ASN by the other Service Providers. ASs has their own numbers for identification. These numbers are called Autonomous System Numbers, ASNs. Firstly, Internet Assigned Numbers Authority (IANA) assigns these AS numbers to the Regional Internet Registries (RIRs) like RIPE, APNIC etc. And then, RIRS assign these AS numbers to the Internet Service Providers or other large organizations. These organizations can be a tech company, a university, a government agency etc. ASN is a 16-bit number and they can be any value between 1 and 65535. This ASN block can be divided into two: 1 – 64511 Public ASNs 64512-65535 Private ASNs 1 to 64511 ASNs are globally unique Public ASNs. They belong to specific organizations or Internet Service Providers. So, one of these addresses can only be used by these specific organization. IANA assign these ASNs to Regional Internet Registries and then they assign these ASNs to specific Internet Service Providers or large organizations like Cisco, Juniper, Nokia, Huawei etc. 4512 to 6553 ASNs are Private ASNs. These range can not be used on Internet but they can be used by everyone. They are like private IP addresses. For example, they can be used for BGP confederations within an autonomous system. Inside an Autonomous System, we use IGP as I mentioned before. How about between Autonomous Systems on Internet? Between Autonomous Systems, EGPs (Exterier Gateway Protocols) are used. And today, there is only one EGP. This is Border Gateway Protocol (BGP). Before, there was also a protocol named EGP (same name). But it is retired. By the way during BGP configuration, one router can belong to only one Autonomous System. So, we can configure BGP on a router with only one ASN. To learn Regional Internet Registry ASNs assigned by IANA you can check the following link: IANA, Assigned AS Numbers You can check the companies and their assigned ASNs on internet. You can test your BGP Knowledge on BGP Practice Tests Page! General BGP Protocol Properties Path Vector Protocol Border Gateway Protocol (BGP) is a Path Vector protocol. So, it has both Link-State and Distance-Vector protocols characteristics. BGP is slower than other Routing Protocols. Because it does Route exploration. According to different policies, BGP select the optimum path for the traffic. And with different path attributes, we can always manipulate BGP Path Selection and we have a high control over routing. Runs Over TCP BGP uses TCP (Transmission Control Protocol) for session establishment. So, it is a secure protocol. For BGP neighborship, firstly, TCP Three-Way Handshake Mechanism works and TCP Connection is established. For this connection, SYN, ACK and SYN ACK messages of TCP is used. After a proper connection, other BGP session establishment processes are done. We will talk about BGP Session Establishment detailly in the next lesson. As you know, protocols use some default port numbers. BGP also uses one of these default port numbers. BGP uses TCP 179 port by default. Supports CIDR Border Gateway Protocol supports CIDR (Classless Inter-Domain Routing). BGP Tables BGP uses three tables for BGP routing. These tables are given below: Neighbor Table BGP Table Routing Table BGP Neighbor Table includes BGP neighbors of the router. All BGP Peers showed in BGP Neighbor Table. BGP Table includes the updates that received from other BGP devices. Routing Table includes the Best Routes to the destination. EBGP & IBGP BGP is one routing protocol but we can divide it into two according to the used location. These are: EBGP (Exterior Border Gateway Protocol) IBGP (Interior Border Gateway Protocol) We use BGP as EBGP (Exterior Border Gateway Protocol) between Autonomous Systems. Two routers in different Autonomous Systems establish BGP Neighborship with EBGP. On the other hand, IBGP (Interior Border Gateway Protocol) is used within the Autonomous System. If two BGP router in the same AS establish a BGP neighborship, this is IBGP neighborship. BGP Administrative Distance For Cisco devices, there are two default BGP Administrative Distance (Preference) for EBGP and IBGP. The default administrative distance value for EBGP is 20. The default administrative distance value for IBGP is 200. For Cisco devices, EBGP Routes are very trustful. So, its AD value is lower than any well-known routing protocols like RIP, OSPF, EIGRP. These are the values used by Cisco for BGP Routes. How about other vendors like Juniper, Huawei, Nokia? Nokia, Juniper and Huawei do not divide preference values into two like Cisco. Nokia and Juniper use 170 as BGP default administrative distance. And Huawei uses 255 as BGP preference. Supports Policies BGP gives us high control opportunity on traffic. To do this, iBGP supports policies. Different policies can be used for different types of traffic. So, we can distinguish traffics and behave different towards different traffic. BGP Best Path Algorithm BGP selects the Best Path according to BGP Best Path Algorithm. There are different BGP Path Attributes which is used on this Best Path Algorithm. BGP checks this orderly and determine the optimum path. We will talk about BGP path attributes detailly in the following lessons. Manipulate Traffic with Path Attributes With Border Gateway Protocol, we can manipulate traffic and we can have more control on routing. By the help of BGP Path Attributes, we can determine the paths and their load ratios. Using BGP Attributes provides redundancy mechanism and load balancing. BGP Neighborship Establishment A Router needs to connect another router with BGP for BGP operation. This is BGP neighborship establishment. BGP uses TCP Three-Way Handshake for BGP Neighborship. BGP Neighborship establishment is a set of states. Each state uses different messages. At the beginning, the state is Idle. After that for BGP peering different states are passed. These are given below: Connect Open Sent Open Confirm Established There is also another state named Active. This means that there is a problem on BGP Neighborship. BGP Messages Border Gateway Protocol uses different message types for its neighborship establishment and routing updates. We will talk about these BGP messages detailly in another lesson but here, let’s write down these messages: Open messages Update messages Keepalieve messages Notification messages Summary BGP is the most important protocol for Internet. Network engineers like to work on BGP a lot. Because, working on BGP Protocol is also an indicator of your networking experience. Always, the most experienced network engineers work on Border Gateway Protocol. Here, we have talked about basic BGP characteristics. In other lessons, we will go through BGP deeply and learn the details of the protocol of Internet like BGP Communities, BGP Filtering, BGP Convergence etc. We will also learn how to configure BGP with different BGP Protocol Examples. Become a Member! Lesson tags: routing, BFP Back to: CCNP Enterprise 350-401 ENCOR v1.1 > BGP Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Name * Email * Website Comment * Δ Previous Next Collapse Expand IPv4 IPv4 Subnetting Private IPv4 Address Ranges APIPA Addresses IPv4 Addressing IPv6 IPv6 Addressing IPv6 Link Local Addresses IPv6 Neighbour Discovery Protocol IPv6 Floating Static Routing IPv6 Address Types IPv6 Configuration Example on Packet Tracer IPv6 and Subnetting ICMP and ARP Ping Command Gratuitous ARP Proxy ARP ICMP (Internet Control Message Protocol) Address Resolution Protocol (ARP) Routing Fundamentals IPv6 Static Route Configuration on Cisco IOS Policy Based Routing (PBR) Static Route Configuration on Cisco Routers IPv6 Routing Protocols Dynamic Routing Protocols IP and Layer 3 Overview RIP RIPng Configuration Example on Cisco IOS RIP Configuration With Packet Tracer RIPng (RIP Next Generation) Routing Information Protocol (RIP) EIGRP EIGRP (Enhanced Interior Gateway Routing Protocol) EIGRP vs OSPF EIGRP Tables EIGRP Packet Types and Neighbourship Key Configurations on EIGRP EIGRP Configuration With Packet Tracer EIGRP for IPv6 EIGRP For IPv6 Configuration On Cisco IOS OSPF OSPF Virtual-Link Configuration On Packet Tracer OSPF Passive Interface LSDB (Link State Database) OSPF Area Border Router (ABR) and ASBR OSPF Cost and Shortest Path First OSPF NSSA and Totally NSSA on Cisco Packet Tracer OSPF Stub Area and Totally-Stub Area on Cisco Packet Tracer OSPF External Routes on Cisco Packet Tracer OSPF Standard Area and Backbone Area on Cisco Packet Tracer OSPFv3 Configuration Example on Cisco IOS OSPFv3 (Open Shortest Path First Version 3) Cisco Single Area OSPF Configuration Other OSPF Key Points OSPF Network Types OSPF Area Types OSPF LSA Types OSPF Packet Types OSPF Adjacency OSPF(Open Shortest Path First) Overview BGP BGP Next Hop Self Command OSPF vs BGP BGP Multi Hop Command BGP Neighbor Update-Source Cisco eBGP Configuration on GNS3 BGP Route Reflector Cisco BGP Route Reflector Configuration on GNS3 BGP Path Attributes - MED BGP Path Attributes - Origin BGP Path Attributes - AS Path BGP Path Attributes - Local Preference BGP Path Attributes - Weight BGP Configuration Example on Packet Tracer BGP AD and BGP Path Attributes IBGP and EBGP BGP Peers, BGP Sessions, BGP Messages BGP (Border Gateway Protocol) Layer 2 Technologies PPPoE Configuration With Packet Tracer Metro Ethernet Overview Frame-Relay Configuration with both Inverse-ARP and Frame-Relay Map Frame Relay Point-to-Point Configuration Multipoint Frame Relay Configuration Point-to-Point Protocol over Ethernet (PPPoE) HDLC and PPP PPP Configuration on Cisco VPN Technologies VPN Types and Protocols of VPN DHCP and DNS Cisco DHCP Relay Agent Configuration with GNS3 Stateless Address Auto Configuration DHCPv6 Overview EtherChannels Etherchannel Cisco PAgP Configuration on GNS3 PAgP Configuration Example LACP Configuration on Cisco IOS Link Aggregation Control Protocol NAT PAT Configuration with Packet Tracer NAT (Network Address Translation) Static NAT Configuration with Packet Tracer Dynamic NAT Configuration with Packet Tracer Access Lists Extended ACL Cisco Configuration Access Control Lists for Traffic Control Standard ACL Configuration With Packet Tracer Security DHCP Snooping Configuration on Packet Tracer REST API Security Cisco 802.1x Configuration WebAuth (Web Authentication) What is DHCP Snooping? Access Control Lists Control Plane Policing (CoPP) Basic Cisco Router Security Configuration SNMP SNMP Configuration On Cisco IOS SNMP – Overview Spanning Tree PVST+ and Rapid PVST+Configuration on Packet Tracer PVST+ and Rapid PVST+ MST Configuration on Cisco MST (Multiple Spanning Tree) STP Operation Spanning Tree Protocol Rapid Spanning Tree Protocol STP Portfast Configuration on Cisco Packet Tracer RSTP Configuration on Cisco Packet Tracer STP Configuration on Cisco Packet Tracer VLANs Switch Virtual Interface Configuration on Packet Tracer Inter VLAN Routing Configuration on GNS3 Inter VLAN Routing Configuration Example VTP Configuration with Packet Tracer DTP and VLAN Frame Tagging Protocols Inter VLAN Routing with Router on Stick Topology VLANs (Virtual Local Area Networks) VLAN Port Assignment and VLAN Port Types VLAN Configuration on Cisco Packet Tracer First Hop Redundancy HSRP Configuration on GNS3 Cisco Stateful Switchover (SSO) GLBP Configuration on Cisco GLBP (Gateway Load Balancing Protocol) VRRP Configuration on Cisco VRRP (Virtual Router Redundancy Protocol) HSRP (Hot Standby Router Protocol) First Hop Redundancy Protocols QoS QoS Policing and Shaping QoS Classification and Marking QoS Port Monitor ERSPAN Configuration on Packet Tracer Remote SPAN Configuration on Packet Tracer Local SPAN Configuration on Packet Tracer Cisco SPAN Overview Path Virtualization IPSec Tunneling Cisco IPSec VPN Configuration Cisco Virtual Routing and Forwarding (VRF) GRE Tunnel Overview GRE Tunnel Configuration with Cisco Packet Tracer Device Access Control Cisco SSH Configuration With GNS3 TACACS+ RADIUS Authentication, Authorization, Accounting AAA Protocols Multicast Protocols Bidirectional PIM (BIDIR-PIM) Multicast Routing IGMPv3 PIM-SM (PIM Sparse Mode) PIM-SSM (Source Specific Multicast) PIM-DM (PIM Dense Mode) PIM (Protocol Independent Multicast) IGMP Snooping IGMP Configuration IGMP Cisco SD-WAN Cisco SD-WAN Verification Cisco vSmart Controller Configuration Cisco vBond Initial Configuration Cisco SD-WAN Components SD-WAN Architecture Wireless Security EAPoL (Extensible Authentication Protocol over LAN) Pre-Shared Key (PSK) Network Security Design 802.1x (Port Based Network Access Control) Network Security: Cisco Threat Defense MACsec (Media Access Control Security) Cisco TrustSec MAC Authentication Bypass (MAB) IP Services Cisco NTP Configuration uRPF (Unicast Reverse Path Forwarding) Precision Time Protocol (PTP) NTP (Network Time Protocol) Network Assurance Cisco Syslog Server Configuration with GNS3 Cisco RESTCONF Configuration Cisco NETCONF Configuration NETCONF Operation Steps NETCONF Protocol Stack NETCONF Overview RESTCONF Conditional debugging Cisco Terminal Monitor and Cisco Logging Monitor Cisco Debug Command Cisco IP SLA and Configuration Flexible Netflow Configuration Flexible Netflow Netflow and Netflow Configuration Automation Chef Overview Ansible vs Puppet vs Chef Ansible Overview Puppet Overview Data Serialization Languages: JSON, YAML, XML Network Automation Tools Cisco SD-Access Overview Traditional Network Management versus Cisco DNA Center Cisco DNA Center Cisco DNA and Intent-Based Networking (IBN) How Network Automation Impacts Network Management REST APIs Overview Network Virtualization Cisco LISP (Locator ID Separation Protocol) Virtual Switching and Virtual Switch (vSwitch) Container vs Virtual Machine Virtual Extensible LAN (VXLAN) Wireless CAPWAP versus LWAPP Wireless Roaming: Layer 2 and Layer 3 Roaming LWAPP Protocol CAPWAP Protocol Access Point Discovery and Join Process Other Lessons Network Ports SearchSearchLatest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024 WHAT YOU WILL FIND? 250.000+ Students All Over The World 8.000+ Questions & Answers 100+ Lab Files & Cheat Sheets 30+ IT/Network Courses A Real Desire To Help You Daily Social Media Shares %100 Satisfaction COURSES CISCO Courses NOKIA Courses HUAWEI Courses JUNIPER Courses PYTHON Course KEY Courses VIDEO Courses UDEMY Courses SPECIALS All Quizes Cheat Sheets Configuration Files Interview Questions IPCisco On Social Media MEMBERSHIP Membership CONTACT Pärnu mnt. 139c – 14, 11317, Tallinn, Estonia info@ipcisco.com Copyright © 2018-2024 IPCisco Disclaimer Privacy Policy Distance Selling Contract",
      "source_url": "https://ipcisco.com/lesson/bgp-border-gateway-protocol/",
      "quality_score": 95,
      "confidence": 90,
      "expert_level": "advanced",
      "scraped_from": "IPcisco_BGP",
      "created_at": "2025-09-04T01:46:17.906259"
    },
    {
      "case_id": "EXPERT_NET_002",
      "title": "Expert Knowledge: OSPF (Open Shortest Path First) ⋆ IpCisco",
      "category": "BGP",
      "technology": "BGP Routing Protocol",
      "description": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Mult...",
      "full_content": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Multicast Course SDN Course Video Courses CCNA 200-301 Labs HCIA Configuration Course NRS I Configuration Course CCNP 350-401 ENCOR Labs Cisco Packet Tracer How To Guide Online Courses Udemy Courses SPECIALS All Quizes CCNA Flashcard Questions Cheat Sheets Protocol Cheat Sheets Subnetting Cheat Sheet Linux Cheat Sheet Python Cheat Sheet CLI Commands Cheat Sheets Miscellaneous Cheat Sheets Network Labs Cisco Packet Tracer Labs Cisco GNS3 Labs Huawei eNSP Labs Nokia GNS3 Labs Short Config Videos Network Tools IPCisco on Social Media Network Engineer Interview Questions Personality Interview Training BLOG MEMBERS Sign In/Up | Members Lost password Sign In/Sign Up SHOP ABOUT About Contact References Donation ENROLL HERE Table of Contents Toggle OSPFv2 Overview OSPF (Open Shortest Path First), is one of the most used Routing Protocol today. OSPF is a standard based Link-State routing protocol. It is a Classless routing protocol which do not send subnet masks with updates. So, it allows to use VLSM. Open Shortest Path First has similarities with the other Link-State routing protocol IS-IS but it differents from it in many points. Open Shortest Path First uses a special algorithm, Dijsktra Alogirthm for route calculations. In other words, it uses Shortest Path First (SPF) method and with this way, the routing calculation is done. In OSPF, both periodic and triggered updates are used. These updates are sent with LSA (Link State Advertisements). There are also different OSPF packets used for the messaging between OSPF routers. OSPF is ideal for large networks and the convergence time of OSPF is very short. In other words, OSPF is a fast converged protocol. It is also prefered because of its secure character. As a hierarchical protocol, Open Shortest Path Firt divided into different Areas. This areas reduce the complexity of the network and opitmize routing tables. You can view detailed OSPF lessons below: Key Lessons: OSPF Adjacency Area Types Packet Types LSA Types Network Types OSPF Cost and SPF Algorithm Virtual Links, Authentication, Timers Areas & Configurations: Single Area OSPF Configuration Standard & Backbone Area Config Stub Area & Totally Stub Area Config NSSA & Totally NSSA Configuration OSPF External Routes OSPFv3 OSPFv3 OSPFv3 Configuration OSPF Tables Open Shortest Path First provides neighbourship between other OSFP routers by the help of OSPF messages. With these messages, OSPF tables are built. And Open Shortest Path First routing mechanims works with this tables. Basically, there are three tables in Open Shrtest Path First. These tables are: Neighboring Table Topology Table Routing Table Neighboring Table, is the table that stotres OSPF neighbor routers. You can see the directly connected OSFP neighbors here. Topoloji Table, is the view of OSPF network. It is also known as LSDB. All the Open Shortest Path First Router connections are stored here. Topology table is identical in all OSPF routers in the Open Shortst ath Firstnetwork. Routing Table, is the tablet hat stores the best paths to the destination. It is the table that is also sued with the other routing prtocols for routing process. In Open Shortest Path First, all routers build its own Topology Table and has the full view of the network. It calculates the next hope independently from other routers. This is also the characteristic of Link-State Protocols. As you remember, Link-State protocols are “OSPF” and “IS-IS”. In Distance-Vector protocols, the situation is not like this. Distance-Vector protocols needs a neighbor to know about the network. Open Shortest Path Fist routers announces the netwrok changes with LSAs eachother. LSDBs are built with these LSAs. The topology of the Open Shortest Path First network is stored in this LSDB (Link State Database). Hierarchical Design and Area Types Open Shortest Path First has an hierarchical architecture. It uses “Areas” for hieararcy. There is a Backbone Area as Area 0 in the center for all OSPF Networks. Around this Backbone Area, Area 0, there are some other Areas. All these areas are connected to this Area 0. If there is a uncontinuous structure, Virtual-Links can be used to connect an area to the Backbone Area (Area 0). With this hierachical architecture of Open Shortest Path First, you can divide your network into different small areas and by doing this, you can reduce overhead of this small areas. In other words, instead of doing LSDB processes for one large area, this is done in smaller areas and update summary LSAs are sent to the other areas. By doing this, LSA traffic is reduced. Beside Backbone Area and Normal Areas, there are alsom other area types in Open Shortest Path First network. You can find these area types below: Standard Area Backbone Area (Area 0) Stub Area Not So Stubby Area (NSSA) Totally Stub Area Totally NSSA In CCNA 200-301, there is only Single Area OSPF. So, we will not explain the other areas here. If you would like to learn OSPF Area types detailly, you can check the related lessons on CCNP ENCOR and CCIE Enterprise Infrastructure courses. OSPF Router Types In OSPF Design there are different Router types. These router types are named according to their roles and their place of the network. Let’s see these routers: Internal Routers: Routers in a Single Area. Backbone Routers: Routers in Backbone Area (Area 0) (At least one interface). Area Border Routers (ABRs): Routers have interfaces at least in two areas. Autonomus System Boundary Routers (ASBRs): Routers connected to an another AS and the routers in which external routes are redistributed. OSPF Administrative Distance Values For Best Path selection, Administrative Distance (Preference) values are very important. Every Routing Protocol has an AD value. The Administrative Distance (Preference) of the Open Shortest Path First is 110 for Cisco devices. This is a little different for Alcatel-Lucent, Huawei and Juniper devices. They use Interneal and External Preference values for Open Shortest Path First. Preference value is 10 for Internal OSPF Routes and 150 for External OSPF Routes on the devices of these vendors. Router ID Router ID is an important term for Open Shortest Path First Operations. Every router has to have a unique Router ID in the Open Shortest Path First Topology. So, generally Router ID is manually configured on all OSPF Routers. If this is not done, the highest interface IP address is selected as Router ID. Open Shortest Path First Cost Open Shortest Path First uses path Cost as its metric. Generally Bandwidth value is used as path Cost. AS a formula, the Cost is calculated like below in OSPF: Cost = Reference BW(default 10 000 000) / BW OSPF Versions Protocols are developed and then they enhanced with new features. This new enhanced versions came with new versions. Open Shortest Path First also has different versions. There are two OSFP versions. These are: OSPFv2 OSPFv3 OSPFv2 is the first version of Open Shortest Path First and it is used with IPv4. OSPFv3 is the enhanced version of OSPFv2 that supports and designed for IPv6. In the below table, you can check the differences of these two versions as summary. In this article, we have talked about an overview of OSPFv2. In the following articles, we will explain this lesson more deeply. If you want to learn more about OSPFv3, you can check IPv6 Routing Protocols lesson. Become a Member! Lesson tags: ospfv2, ospf, routing Back to: JNCIE > OSPF Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Name * Email * Website Comment * Δ Previous Next Collapse Expand IPv6 IPv6 Configuration Example on Juniper IPv6 Address Types IPv6 Header versus IPv4 Header OSPF OSPFv2 Configuration on Juniper OSPF (Open Shortest Path First) OSPF Packet Types OSPF Adjacency OSPF Area Types OSPF LSA Types OSPF Network Types OSPF Other Key Lessons OSPFv3 Overview WAN Metro Ethernet BGP Border Gateway Protocol IBGP versus EBGP BGP Next Hop Self on Juniper Path Attributes of BGP BGP Messages, BGP Peers and BGP Sessions BGP Path Attributes: MED BGP Path Attributes: Origin BGP Path Attributes: AS Path BGP Path Attributes : Local Preference BGP Configuration Example on Juniper IS-IS ISIS Configuration on Juniper IS-IS Adjacency IS-IS Packet Types IS-IS Addresses Intermediate System to Intermediate System Protocol IS-IS versus OSPF Security RADIUS Overview Dynamic ARP Inspection Juniper Configuration TACACS+ Overview AAA AAA Protocols MPLS LDP Label Distribution MPLS Fundamentals MPLS Label Switching Operation RSVP-TE Label Distribution Protocol, LDP DHCP, DNS, NAT NAT DNS DHCP IP Allocation Operation DHCP High Availability LACP Configuration on Juniper BFD (Bidirectional Forwarding Detection) SNMP Configuration On Juniper Link Aggregation with LACP SNMP VRRP IP Multicast MLD (Multicast Listener Discovery) MLD Operations IGMP IGMP Snooping Multicast IP Addresses Multicast MAC Addresses Ethernet Switching and STP Network Cabling Local Area Networks (LAN) Ethernet Switches How STP Works? Rapid Spanning Tree Protocol Spanning Tree Protocol VPN Layer 2 VPN (VPLS) Overview Layer 2 VPN (VPLS) Topologies Layer 2 VPN (VPLS) MAC Learning Layer 3 VPN Overview Layer 3 VPN Operations Layer 3 VPN Data Plane MPLS VPN Labelling Basic Routing RIP Configuration on Juniper Dynamic Routing Protocols Routing Tables of Juniper Routers IPv6 Static Routing Example On Juniper IPv4 Static Routing Example on Juniper ARP and ICMP ARP Proxy ARP Gratuitous ARP ICMP Important Terms What is CIR and PIR? SearchSearchLatest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024 WHAT YOU WILL FIND? 250.000+ Students All Over The World 8.000+ Questions & Answers 100+ Lab Files & Cheat Sheets 30+ IT/Network Courses A Real Desire To Help You Daily Social Media Shares %100 Satisfaction COURSES CISCO Courses NOKIA Courses HUAWEI Courses JUNIPER Courses PYTHON Course KEY Courses VIDEO Courses UDEMY Courses SPECIALS All Quizes Cheat Sheets Configuration Files Interview Questions IPCisco On Social Media MEMBERSHIP Membership CONTACT Pärnu mnt. 139c – 14, 11317, Tallinn, Estonia info@ipcisco.com Copyright © 2018-2024 IPCisco Disclaimer Privacy Policy Distance Selling Contract",
      "source_url": "https://ipcisco.com/lesson/ospf-open-shortest-path-first/",
      "quality_score": 95,
      "confidence": 90,
      "expert_level": "advanced",
      "scraped_from": "IPcisco_OSPF",
      "created_at": "2025-09-04T01:46:17.906326"
    }
  ]
}