{
  "metadata": {
    "category": "networking",
    "source_file": "comprehensive_expert_training_20250904_015046",
    "processed_at": "2025-09-04T02:21:04.957305",
    "total_cases": 7,
    "organization_system": "OpenGenNet AI Expert Knowledge Organizer"
  },
  "expert_cases": [
    {
      "case_id": "BATCH_EXPERT_0001",
      "title": "Expert Knowledge: OSPF (Open Shortest Path First) ⋆ IpCisco",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "Table of Contents Toggle OSPFv2 Overview OSPF (Open Shortest Path First), is one of the most used Routing Protocol today. OSPF is a standard based Link-State routing protocol. It is a Classless routing protocol which do not send subnet masks with updates. So, it allows to use VLSM. Open Shortest Path First has similarities with the other Link-State routing protocol IS-IS but it differents from it in many points. Open Shortest Path First uses a special algorithm, Dijsktra Alogirthm for route calculations. In other words, it uses Shortest Path First (SPF) method and with this way, the routing calculation is done. In OSPF, both periodic and triggered updates are used. These updates are sent with LSA (Link State Advertisements). There are also ...",
      "full_content": "Table of Contents Toggle OSPFv2 Overview OSPF (Open Shortest Path First), is one of the most used Routing Protocol today. OSPF is a standard based Link-State routing protocol. It is a Classless routing protocol which do not send subnet masks with updates. So, it allows to use VLSM. Open Shortest Path First has similarities with the other Link-State routing protocol IS-IS but it differents from it in many points. Open Shortest Path First uses a special algorithm, Dijsktra Alogirthm for route calculations. In other words, it uses Shortest Path First (SPF) method and with this way, the routing calculation is done. In OSPF, both periodic and triggered updates are used. These updates are sent with LSA (Link State Advertisements). There are also different OSPF packets used for the messaging between OSPF routers. OSPF is ideal for large networks and the convergence time of OSPF is very short. In other words, OSPF is a fast converged protocol. It is also prefered because of its secure character. As a hierarchical protocol, Open Shortest Path Firt divided into different Areas. This areas reduce the complexity of the network and opitmize routing tables. You can view detailed OSPF lessons below: Key Lessons: OSPF Adjacency Area Types Packet Types LSA Types Network Types OSPF Cost and SPF Algorithm Virtual Links, Authentication, Timers Areas & Configurations: Single Area OSPF Configuration Standard & Backbone Area Config Stub Area & Totally Stub Area Config NSSA & Totally NSSA Configuration OSPF External Routes OSPFv3 OSPFv3 OSPFv3 Configuration OSPF Tables Open Shortest Path First provides neighbourship between other OSFP routers by the help of OSPF messages. With these messages, OSPF tables are built. And Open Shortest Path First routing mechanims works with this tables. Basically, there are three tables in Open Shrtest Path First. These tables are: Neighboring Table Topology Table Routing Table Neighboring Table, is the table that stotres OSPF neighbor routers. You can see the directly connected OSFP neighbors here. Topoloji Table, is the view of OSPF network. It is also known as LSDB. All the Open Shortest Path First Router connections are stored here. Topology table is identical in all OSPF routers in the Open Shortst ath Firstnetwork. Routing Table, is the tablet hat stores the best paths to the destination. It is the table that is also sued with the other routing prtocols for routing process. In Open Shortest Path First, all routers build its own Topology Table and has the full view of the network. It calculates the next hope independently from other routers. This is also the characteristic of Link-State Protocols. As you remember, Link-State protocols are “OSPF” and “IS-IS”. In Distance-Vector protocols, the situation is not like this. Distance-Vector protocols needs a neighbor to know about the network. Open Shortest Path Fist routers announces the netwrok changes with LSAs eachother. LSDBs are built with these LSAs. The topology of the Open Shortest Path First network is stored in this LSDB (Link State Database). Hierarchical Design and Area Types Open Shortest Path First has an hierarchical architecture. It uses “Areas” for hieararcy. There is a Backbone Area as Area 0 in the center for all OSPF Networks. Around this Backbone Area, Area 0, there are some other Areas. All these areas are connected to this Area 0. If there is a uncontinuous structure, Virtual-Links can be used to connect an area to the Backbone Area (Area 0). With this hierachical architecture of Open Shortest Path First, you can divide your network into different small areas and by doing this, you can reduce overhead of this small areas. In other words, instead of doing LSDB processes for one large area, this is done in smaller areas and update summary LSAs are sent to the other areas. By doing this, LSA traffic is reduced. Beside Backbone Area and Normal Areas, there are alsom other area types in Open Shortest Path First network. You can find these area types below: Standard Area Backbone Area (Area 0) Stub Area Not So Stubby Area (NSSA) Totally Stub Area Totally NSSA In CCNA 200-301, there is only Single Area OSPF. So, we will not explain the other areas here. If you would like to learn OSPF Area types detailly, you can check the related lessons on CCNP ENCOR and CCIE Enterprise Infrastructure courses. OSPF Router Types In OSPF Design there are different Router types. These router types are named according to their roles and their place of the network. Let’s see these routers: Internal Routers: Routers in a Single Area. Backbone Routers: Routers in Backbone Area (Area 0) (At least one interface). Area Border Routers (ABRs): Routers have interfaces at least in two areas. Autonomus System Boundary Routers (ASBRs): Routers connected to an another AS and the routers in which external routes are redistributed. OSPF Administrative Distance Values For Best Path selection, Administrative Distance (Preference) values are very important. Every Routing Protocol has an AD value. The Administrative Distance (Preference) of the Open Shortest Path First is 110 for Cisco devices. This is a little different for Alcatel-Lucent, Huawei and Juniper devices. They use Interneal and External Preference values for Open Shortest Path First. Preference value is 10 for Internal OSPF Routes and 150 for External OSPF Routes on the devices of these vendors. Router ID Router ID is an important term for Open Shortest Path First Operations. Every router has to have a unique Router ID in the Open Shortest Path First Topology. So, generally Router ID is manually configured on all OSPF Routers. If this is not done, the highest interface IP address is selected as Router ID. Open Shortest Path First Cost Open Shortest Path First uses path Cost as its metric. Generally Bandwidth value is used as path Cost. AS a formula, the Cost is calculated like below in OSPF: Cost = Reference BW(default 10 000 000) / BW OSPF Versions Protocols are developed and then they enhanced with new features. This new enhanced versions came with new versions. Open Shortest Path First also has different versions. There are two OSFP versions. These are: OSPFv2 OSPFv3 OSPFv2 is the first version of Open Shortest Path First and it is used with IPv4. OSPFv3 is the enhanced version of OSPFv2 that supports and designed for IPv6. In the below table, you can check the differences of these two versions as summary. In this article, we have talked about an overview of OSPFv2. In the following articles, we will explain this lesson more deeply. If you want to learn more about OSPFv3, you can check IPv6 Routing Protocols lesson. Become a Member! Lesson tags: ospfv2, ospf, routing Back to: JNCIE > OSPF Leave a Reply Cancel reply  Collapse Expand IPv6 IPv6 Configuration Example on Juniper IPv6 Address Types IPv6 Header versus IPv4 Header OSPF OSPFv2 Configuration on Juniper OSPF (Open Shortest Path First) OSPF Packet Types OSPF Adjacency OSPF Area Types OSPF LSA Types OSPF Network Types OSPF Other Key Lessons OSPFv3 Overview WAN Metro Ethernet BGP Border Gateway Protocol IBGP versus EBGP BGP Next Hop Self on Juniper Path Attributes of BGP BGP Messages, BGP Peers and BGP Sessions BGP Path Attributes: MED BGP Path Attributes: Origin BGP Path Attributes: AS Path BGP Path Attributes : Local Preference BGP Configuration Example on Juniper IS-IS ISIS Configuration on Juniper IS-IS Adjacency IS-IS Packet Types IS-IS Addresses Intermediate System to Intermediate System Protocol IS-IS versus OSPF Security RADIUS Overview Dynamic ARP Inspection Juniper Configuration TACACS+ Overview AAA AAA Protocols MPLS LDP Label Distribution MPLS Fundamentals MPLS Label Switching Operation RSVP-TE Label Distribution Protocol, LDP DHCP, DNS, NAT NAT DNS DHCP IP Allocation Operation DHCP High Availability LACP Configuration on Juniper BFD (Bidirectional Forwarding Detection) SNMP Configuration On Juniper Link Aggregation with LACP SNMP VRRP IP Multicast MLD (Multicast Listener Discovery) MLD Operations IGMP IGMP Snooping Multicast IP Addresses Multicast MAC Addresses Ethernet Switching and STP Network Cabling Local Area Networks (LAN) Ethernet Switches How STP Works? Rapid Spanning Tree Protocol Spanning Tree Protocol VPN Layer 2 VPN (VPLS) Overview Layer 2 VPN (VPLS) Topologies Layer 2 VPN (VPLS) MAC Learning Layer 3 VPN Overview Layer 3 VPN Operations Layer 3 VPN Data Plane MPLS VPN Labelling Basic Routing RIP Configuration on Juniper Dynamic Routing Protocols Routing Tables of Juniper Routers IPv6 Static Routing Example On Juniper IPv4 Static Routing Example on Juniper ARP and ICMP ARP Proxy ARP Gratuitous ARP ICMP Important Terms What is CIR and PIR? Latest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024",
      "source_url": "https://ipcisco.com/lesson/ospf-open-shortest-path-first/",
      "source_category": "networking_tutorials",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "OSPFv2 Overview",
        "OSPF Tables",
        "Hierarchical Design and Area Types",
        "OSPF Router Types",
        "OSPF Administrative Distance Values",
        "Router ID",
        "Open Shortest Path First Cost",
        "OSPF Versions",
        "Leave a Reply Cancel reply",
        "IPv6"
      ],
      "content_length": 9462,
      "created_at": "2025-09-04T01:50:46.365311"
    },
    {
      "case_id": "BATCH_EXPERT_0002",
      "title": "Expert Knowledge: EIGRP (Enhanced Interior Gateway Routing Protocol) ⋆ IpCisco",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "Table of Contents Toggle EIGRP Overview EIGRP Protocol is one of the most used Dynamic Routing Protocol as IGP (Interior Gateway Protocol). Especially it is used for Routing purpose inside the networks that is mostly consist of Cisco devices. EIGRP (Enhanced Interior Gateway Routing Protocol) is a Hybrid Routing Protocol that show both Distance Vector and Link-State Routing Protocol properties. It was developed by Cisco as an enhancement to IGRP (Interior Gateway Routing Protocol) and as a Cisco proprietary protocol and it is only available on Cisco devices. You can test your Routing Knowledge on CCNP ENCOR Practice Tests and CCNP ENARSI Practice Page Page! EIGRP DUAL Algorithm EIGRP uses DUAL (Diffusing Update Algorithm) for routing calcul...",
      "full_content": "Table of Contents Toggle EIGRP Overview EIGRP Protocol is one of the most used Dynamic Routing Protocol as IGP (Interior Gateway Protocol). Especially it is used for Routing purpose inside the networks that is mostly consist of Cisco devices. EIGRP (Enhanced Interior Gateway Routing Protocol) is a Hybrid Routing Protocol that show both Distance Vector and Link-State Routing Protocol properties. It was developed by Cisco as an enhancement to IGRP (Interior Gateway Routing Protocol) and as a Cisco proprietary protocol and it is only available on Cisco devices. You can test your Routing Knowledge on CCNP ENCOR Practice Tests and CCNP ENARSI Practice Page Page! EIGRP DUAL Algorithm EIGRP uses DUAL (Diffusing Update Algorithm) for routing calculations. Periodic Updates are not used but if a change occurs in the network like up/down links, update messages are sent. With DUAL Algotirhm, Topology table is built. In Topology Table both the Best Routes and the Backup Routes to a destination are stored. This provides, a Fast Convergence characteristic, a Fast Convergence Mechanims. The most important characteristic of this routing protocol is that, it is a Fast Converged Routing Protocol. Enhanced Interior Gateway Routing Protocol keeps the “Backup Routes” beside the “Best Route” to a destination in the Topology table. So, during a failure, it does not need to calculate a new route. Instead, it uses the Backup Route towards the destination. EIGRP Messages EIGRP uses different types of messages to build neighbourship, to keep the connection and for the updates. These main messages are : Hello Update Query Reply Ack Hello Packets are used to establish and maintain EIGRP Neighbourship. Update Packets are used to send routing updates. Query Packets are used to ask for any routing update, requests an update. Reply Packets are used as a response to the Query Packets. ACK Packets are used as a feedback to the Update, Query or Reply packets as a feedback mechanism. We will learn these EIGRP Packets detailly in next lessons. EIGRP Tables Enhanced Interior Gateway Routing Protocol has three tables. These tables are used on Routing Operation. The EIGRP Tables are given below: Neighbour Table Topology Table Routing Table Neighbor Table is the table that keeps All EIGRP Neighbour Routers. Topology Table is the table that keeps All Routes to all the destinations Routing Table is the table that keeps the Best Routes to any destinations. Classless Protocol Enhanced Interior Gateway Routing Protocol is a Classless Routing Protocol. It sends the subnet masks in the Update Packets. VLSM Support Enhanced Interior Gateway Routing Protocol also supports VLSM (Variable Length Subnet Mask). Different Subnet Masks can be used with this protocol. By using VLSM, it is a protocol that uses the IP addresses range very efficent. EIGRP Metrics Enhanced Interior Gateway Routing Protocol uses a very complex metric by using bandwith, delay, load, reliability and MTU values. This EIGRP Metric Formula is showed below: EIGRP Metric Formula As you can see, there are some K values in EGRP metric formule. By default these values are: K1 (Bandwidth) = 1 K2 (Load) = 0 K3 (Delay) = 1 K4(Reliability) = 0 K5(MTU) = 0 These K values need to be match in both ends to form an EIGRP Neighbourship. You can change these values but it is not recommended. By default Bandwith and Delay values become important only and used as a metric (The other parts will be 0, becaue of multiplying with 0). So, we can say that, Enhanced Interior Gateway Routing Protocol uses the path with minimum bandwidth and the total delay to a destination. Bandwidth = 107/Bandwidth in Kbps Delay = Delay / 10 The default Formula becomes like below (with default K values ) : You can test your Routing Knowledge on CCNP ENCOR Practice Tests and CCNP ENARSI Practice Page Page! EIGRP Default Metric Protocol Indemendence Enhanced Interior Gateway Routing Protocol works with IPv4, IPv6, IPX and AppleTalk Routed Protocols. So with this characteristic, we can say that EIGRP is a Protocol Independent Routing Protocol. EIGRP Administrative Distance The Administrative Distance (Preference) values for EIGRP are given below: Internal : 90 External : 170 Summary : 5 If there are routes to a destination with Enhanced Interior Gateway Routing Protocol, RIP and OSPF, EIGRP (Internal) Routes are prefered over RIP and OSPF Routes. Because the administartive distance of RIP is 120 and OSPF Administrative Distance is 110. You can find Administrative Distance (Preference) Table for Cisco, Juniper, Nokia and Huawei, on IPCisco.com. RTP for Reliable Delivery Enhanced Interior Gateway Routing Protocol uses RTP (Reliable Transport Protocol) to control sending and acknowledging messages. In other words, RTP ensures delivery of packets. RTP is used by Update, Query and Reply packets. Hello and Ack packets do not use RTP. Become a Member! Lesson tags: EIGRP, routing Back to: CCNP Enterprise 300-410 ENARSI > EIGRP Leave a Reply Cancel reply  Collapse Expand Access Lists Access Control Lists for Traffic Control Standard ACL Configuration With Packet Tracer Extended ACL Configuration Example EIGRP Key Configurations on EIGRP EIGRP For IPv6 Configuration On Cisco IOS EIGRP for IPv6 EIGRP Configuration With Packet Tracer EIGRP Packet Types and Neighbourship EIGRP Tables EIGRP (Enhanced Interior Gateway Routing Protocol) BGP Path Attributes: Weight Path Attributes : Local Preference Path Attributes: AS Path Path Attributes: Origin Path Attributes: MED BGP BGP Peers, BGP Sessions and BGP Messages IBGP versus EBGP BGP Path Attributes BGP Configuration Example BGP Community BGP Route Reflector BGP Confederation BGP Next Hop Self Command VPN Technologies MPLS VPN Labelling MPLS Basics MPLS Label Switching Mechanims Enabling MPLS On Cisco Routers DHCP DHCP (Dynamic Host Configuration Protocol) DHCP IP Allocation Operation Router DHCP Configuration with Packet Tracer BFD Bidirectional Forwarding Detection RIP Routing Information Protocol (RIP) RIP Configuration With Packet Tracer Latest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024",
      "source_url": "https://ipcisco.com/lesson/eigrp-enhanced-interior-gateway-routing-protocol/",
      "source_category": "networking_tutorials",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "EIGRP Overview",
        "EIGRP DUAL Algorithm",
        "EIGRP Messages",
        "EIGRP Tables",
        "Classless Protocol",
        "VLSM Support",
        "EIGRP Metrics",
        "Protocol Indemendence",
        "EIGRP Administrative Distance",
        "RTP for Reliable Delivery"
      ],
      "content_length": 6840,
      "created_at": "2025-09-04T01:50:46.365541"
    },
    {
      "case_id": "BATCH_EXPERT_0003",
      "title": "Expert Knowledge: Spanning Tree Protocol | STP Overview | STP Types ⋆ IPCisco",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "Table of Contents Toggle STP Overview In Layer 2 domain, redundancy is an important case. To provide redundant links, multiple connections are done between switches. But this redundancy mechanism can cause an undesirable situation that is called “L2 Loop”. To provide L2 redundancy and to avoid L2 loops, Spanning Tree Protocol (STP) has been developed. In this lesson we will focus STP Overview. In another lesson we will focus STP Configuration. You can also view Spanning Tree Protocol details lesson. During the development period, various versions of STP has been introduced. Different standards has been created beside Cisco specific versions. These STP versions are : STP (Spanning Tree Protocol) – 802.1D RSTP(Rapid Spanning Tree Protocol) – ...",
      "full_content": "Table of Contents Toggle STP Overview In Layer 2 domain, redundancy is an important case. To provide redundant links, multiple connections are done between switches. But this redundancy mechanism can cause an undesirable situation that is called “L2 Loop”. To provide L2 redundancy and to avoid L2 loops, Spanning Tree Protocol (STP) has been developed. In this lesson we will focus STP Overview. In another lesson we will focus STP Configuration. You can also view Spanning Tree Protocol details lesson. During the development period, various versions of STP has been introduced. Different standards has been created beside Cisco specific versions. These STP versions are : STP (Spanning Tree Protocol) – 802.1D RSTP(Rapid Spanning Tree Protocol) – 802.1W PVST+(Per VLAN Spanning Tree Plus) – Cisco Proprietary Rapid PVST+(Rapid Per VLAN Spanning Tree Plus) – Cisco Proprietary MST(Multiple Spanning Tree) – 802.1s You can also view Cisco Packet Tracer Spanning Tree Spanning Tree Examples: STP Configuration RSTP Configuration STP Portfast Configuration PVST+ Configuration In this article, mainly we will focus on STP (802.1D). Redundant Layer 2 Problems Redundancy is an important term for a network. Layer 2 Redundancy is also important but need more caution. Without a mechanims like STP, Layer 2 Redundancy mechanisms can cause the below problems: Layer 2 Loops and Broadcast Storms MAC Address Instability Duplicate Frame Transmission Let’s talk about each of these Layer 2 Redundacy problems. Layer 2 Loops and Broadcast Storms Layer 2 Loops can occur when there is a multiple available Layer 2 link and this links also send and receive frames more than one. And because of the fact that, there is no TTL mechanims in Layer 2, Layer 2 Loops occurs. As you remember, in Layer 3, there is a TTL mechanism. Think about the below topology: Here, when Switch A receives a frame from Segment 1 and send it to the Segment 2, Switch B also can learn it from Segment 2. And it also sends this frame to Segment 1 as if it is being done first time. So, frames are doubled and a Layer 2 Loop Occured. And this Layer 2 loop causes a Broadcast Storm. An infinite frame send/receive process occurs. One loop in a Layer 2 domain can cause one more Alyer 2 loops even if the siwtched network is a large network. MAC Address Instability This Loops also cause a MAC Instability issue. As you remember, source address of a frame is important for MAC address types. These tables are created with source ports and MAC addresses. During a Loop, a frame can be received from different sources. So MAC Instability problem occurs. Here, a MAC table can have multiple MAC addresses for the same ports. This is an undefinable case for switches. Multiple Frame Transmission Multiple Frame Transmission is the problem of multiple, unnecessariliy transfer of Layer 2 frames. Because of there are multiple paths to a destination, same frame can be sent through different ways and this causes multiple frame transmission. How STP Avoid Layer 2 Loops? Now you can think that, we will both want to have redundant links and we want to avoid from Layer 2 Loops. How can we achieve this? We will achieve this with the Spanning Tree Protocol(STP). Spanning Tree Protocol (STP) has a mechanims to avoid Layer 2 Loops. With its mechanism, it checked all the available links. It determiens primary and backups of redundant links. According to some algorithms, some of the links pruned and only one available link become active at the same time to a destination. We can say that Spanning Tree Protocol (STP) mechanims basically prunes the unnecessary links at that time. If this link become offline because of a problem, then STP make another link as active. And the communication continue with another available way. At a time, only one link is active with STP. BPDU BPDU is the abbreviation of Bridge Protocol Data Unit. BPDU is the messages used between switches. BPDUs are sent and received from the ports. But blocking ports are only receive them to determine any failure etc. They do not sent BPDUs. Become a Member! Lesson tags: STP, Spanning Tree Back to: CCNP Enterprise 350-401 ENCOR v1.1 > Spanning Tree Leave a Reply Cancel reply  Collapse Expand IPv4 IPv4 Subnetting Private IPv4 Address Ranges APIPA Addresses IPv4 Addressing IPv6 IPv6 Addressing IPv6 Link Local Addresses IPv6 Neighbour Discovery Protocol IPv6 Floating Static Routing IPv6 Address Types IPv6 Configuration Example on Packet Tracer IPv6 and Subnetting ICMP and ARP Ping Command Gratuitous ARP Proxy ARP ICMP (Internet Control Message Protocol) Address Resolution Protocol (ARP) Routing Fundamentals IPv6 Static Route Configuration on Cisco IOS Policy Based Routing (PBR) Static Route Configuration on Cisco Routers IPv6 Routing Protocols Dynamic Routing Protocols IP and Layer 3 Overview RIP RIPng Configuration Example on Cisco IOS RIP Configuration With Packet Tracer RIPng (RIP Next Generation) Routing Information Protocol (RIP) EIGRP EIGRP (Enhanced Interior Gateway Routing Protocol) EIGRP vs OSPF EIGRP Tables EIGRP Packet Types and Neighbourship Key Configurations on EIGRP EIGRP Configuration With Packet Tracer EIGRP for IPv6 EIGRP For IPv6 Configuration On Cisco IOS OSPF OSPF Virtual-Link Configuration On Packet Tracer OSPF Passive Interface LSDB (Link State Database) OSPF Area Border Router (ABR) and ASBR OSPF Cost and Shortest Path First OSPF NSSA and Totally NSSA on Cisco Packet Tracer OSPF Stub Area and Totally-Stub Area on Cisco Packet Tracer OSPF External Routes on Cisco Packet Tracer OSPF Standard Area and Backbone Area on Cisco Packet Tracer OSPFv3 Configuration Example on Cisco IOS OSPFv3 (Open Shortest Path First Version 3) Cisco Single Area OSPF Configuration Other OSPF Key Points OSPF Network Types OSPF Area Types OSPF LSA Types OSPF Packet Types OSPF Adjacency OSPF(Open Shortest Path First) Overview BGP BGP Next Hop Self Command OSPF vs BGP BGP Multi Hop Command BGP Neighbor Update-Source Cisco eBGP Configuration on GNS3 BGP Route Reflector Cisco BGP Route Reflector Configuration on GNS3 BGP Path Attributes - MED BGP Path Attributes - Origin BGP Path Attributes - AS Path BGP Path Attributes - Local Preference BGP Path Attributes - Weight BGP Configuration Example on Packet Tracer BGP AD and BGP Path Attributes IBGP and EBGP BGP Peers, BGP Sessions, BGP Messages BGP (Border Gateway Protocol) Layer 2 Technologies PPPoE Configuration With Packet Tracer Metro Ethernet Overview Frame-Relay Configuration with both Inverse-ARP and Frame-Relay Map Frame Relay Point-to-Point Configuration Multipoint Frame Relay Configuration Point-to-Point Protocol over Ethernet (PPPoE) HDLC and PPP PPP Configuration on Cisco VPN Technologies VPN Types and Protocols of VPN DHCP and DNS Cisco DHCP Relay Agent Configuration with GNS3 Stateless Address Auto Configuration DHCPv6 Overview EtherChannels Etherchannel Cisco PAgP Configuration on GNS3 PAgP Configuration Example LACP Configuration on Cisco IOS Link Aggregation Control Protocol NAT PAT Configuration with Packet Tracer NAT (Network Address Translation) Static NAT Configuration with Packet Tracer Dynamic NAT Configuration with Packet Tracer Access Lists Extended ACL Cisco Configuration Access Control Lists for Traffic Control Standard ACL Configuration With Packet Tracer Security DHCP Snooping Configuration on Packet Tracer REST API Security Cisco 802.1x Configuration WebAuth (Web Authentication) What is DHCP Snooping? Access Control Lists Control Plane Policing (CoPP) Basic Cisco Router Security Configuration SNMP SNMP Configuration On Cisco IOS SNMP – Overview Spanning Tree PVST+ and Rapid PVST+Configuration on Packet Tracer PVST+ and Rapid PVST+ MST Configuration on Cisco MST (Multiple Spanning Tree) STP Operation Spanning Tree Protocol Rapid Spanning Tree Protocol STP Portfast Configuration on Cisco Packet Tracer RSTP Configuration on Cisco Packet Tracer STP Configuration on Cisco Packet Tracer VLANs Switch Virtual Interface Configuration on Packet Tracer Inter VLAN Routing Configuration on GNS3 Inter VLAN Routing Configuration Example VTP Configuration with Packet Tracer DTP and VLAN Frame Tagging Protocols Inter VLAN Routing with Router on Stick Topology VLANs (Virtual Local Area Networks) VLAN Port Assignment and VLAN Port Types VLAN Configuration on Cisco Packet Tracer First Hop Redundancy HSRP Configuration on GNS3 Cisco Stateful Switchover (SSO) GLBP Configuration on Cisco GLBP (Gateway Load Balancing Protocol) VRRP Configuration on Cisco VRRP (Virtual Router Redundancy Protocol) HSRP (Hot Standby Router Protocol) First Hop Redundancy Protocols QoS QoS Policing and Shaping QoS Classification and Marking QoS Port Monitor ERSPAN Configuration on Packet Tracer Remote SPAN Configuration on Packet Tracer Local SPAN Configuration on Packet Tracer Cisco SPAN Overview Path Virtualization IPSec Tunneling Cisco IPSec VPN Configuration Cisco Virtual Routing and Forwarding (VRF) GRE Tunnel Overview GRE Tunnel Configuration with Cisco Packet Tracer Device Access Control Cisco SSH Configuration With GNS3 TACACS+ RADIUS Authentication, Authorization, Accounting AAA Protocols Multicast Protocols Bidirectional PIM (BIDIR-PIM) Multicast Routing IGMPv3 PIM-SM (PIM Sparse Mode) PIM-SSM (Source Specific Multicast) PIM-DM (PIM Dense Mode) PIM (Protocol Independent Multicast) IGMP Snooping IGMP Configuration IGMP Cisco SD-WAN Cisco SD-WAN Verification Cisco vSmart Controller Configuration Cisco vBond Initial Configuration Cisco SD-WAN Components SD-WAN Architecture Wireless Security EAPoL (Extensible Authentication Protocol over LAN) Pre-Shared Key (PSK) Network Security Design 802.1x (Port Based Network Access Control) Network Security: Cisco Threat Defense MACsec (Media Access Control Security) Cisco TrustSec MAC Authentication Bypass (MAB) IP Services Cisco NTP Configuration uRPF (Unicast Reverse Path Forwarding) Precision Time Protocol (PTP) NTP (Network Time Protocol) Network Assurance Cisco Syslog Server Configuration with GNS3 Cisco RESTCONF Configuration Cisco NETCONF Configuration NETCONF Operation Steps NETCONF Protocol Stack NETCONF Overview RESTCONF Conditional debugging Cisco Terminal Monitor and Cisco Logging Monitor Cisco Debug Command Cisco IP SLA and Configuration Flexible Netflow Configuration Flexible Netflow Netflow and Netflow Configuration Automation Chef Overview Ansible vs Puppet vs Chef Ansible Overview Puppet Overview Data Serialization Languages: JSON, YAML, XML Network Automation Tools Cisco SD-Access Overview Traditional Network Management versus Cisco DNA Center Cisco DNA Center Cisco DNA and Intent-Based Networking (IBN) How Network Automation Impacts Network Management REST APIs Overview Network Virtualization Cisco LISP (Locator ID Separation Protocol) Virtual Switching and Virtual Switch (vSwitch) Container vs Virtual Machine Virtual Extensible LAN (VXLAN) Wireless CAPWAP versus LWAPP Wireless Roaming: Layer 2 and Layer 3 Roaming LWAPP Protocol CAPWAP Protocol Access Point Discovery and Join Process Other Lessons Network Ports Latest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024",
      "source_url": "https://ipcisco.com/lesson/spanning-tree-protocol/",
      "source_category": "networking_tutorials",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "STP Overview",
        "Redundant Layer 2 Problems",
        "Layer 2 Loops and Broadcast Storms",
        "MAC Address Instability",
        "Multiple Frame Transmission",
        "How STP Avoid Layer 2 Loops?",
        "BPDU",
        "Leave a Reply Cancel reply",
        "IPv4",
        "IPv6"
      ],
      "content_length": 11842,
      "created_at": "2025-09-04T01:50:46.365789"
    },
    {
      "case_id": "BATCH_EXPERT_0004",
      "title": "Expert Knowledge: VLANs | What is a VLAN? | Virtual LANs ⋆ IPCisco",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "Table of Contents Toggle What is a VLAN? In this lesson, we will talk about one of the key lessons in networking, especially in switching. We will explain VLAN definition and we will answer the question what is a VLAN? In the following lessons, we will learn the details of Virtual LANs and we will practice with VLAN Configuration Examples . You can also check the definion on Wiki. VLAN Definition If we do a simple VLAN definition, Virtual Local Area Networks are the Logical Virtual Networks that groups network devices in it. In another definition, they are a layer 2 technology with which you can seperate big networks into smaller networks. This can be done for reducing broadcast traffic, network performance improvement, security purpose or ...",
      "full_content": "Table of Contents Toggle What is a VLAN? In this lesson, we will talk about one of the key lessons in networking, especially in switching. We will explain VLAN definition and we will answer the question what is a VLAN? In the following lessons, we will learn the details of Virtual LANs and we will practice with VLAN Configuration Examples . You can also check the definion on Wiki. VLAN Definition If we do a simple VLAN definition, Virtual Local Area Networks are the Logical Virtual Networks that groups network devices in it. In another definition, they are a layer 2 technology with which you can seperate big networks into smaller networks. This can be done for reducing broadcast traffic, network performance improvement, security purpose or to seperate different departments each other and for network flexibility. Basically VLAN (Virtual Local Area Network) In a company, different Virtual LANs can be used for different departments. Think about that these departments are IT, HR and Finance. In a single company LAN, with Virtual LANs, each of these department networks become separate networks. Virtual LANs are Logical networks. In the first place they are defined on the switches and then the ports are assigned to them. By doing this, VLANs members ports appear. VLAN (Virtual Local Area Network)We will learn the key points of Virtual LANs, but firstly, let’s check two important domain  Network Traffic Types Policing and Shaping in QoS Classification and Marking in QoS Quality of Service Overview AAA Radius Configuration for Wireless Users Cisco RADIUS Server Configuration on Packet Tracer TACACS+ Overview RADIUS Overview AAA Protocols : RADIUS and TACACS+ Authentication, Authorization, Accounting (AAA) Wireless WLAN Frequency Bands SSID Meaning Other Wireless Network Extention Types Wireless Principles WLAN Components Wireless Network Design Models WLC Management Access Connections Wireless Access Point Modes Wireless Security Protocols WLAN Configuration on Packet Tracer Security Fundamentals DHCP Snooping Configuration on Packet Tracer Cisco Banner Configuration on Packet Tracer What is DHCP Snooping? Access Control Lists Multifactor Authentication (MFA) Dynamic ARP Inspection Cyber Attacks, Network Attacks, Threats and Mitigation 802.1x (Port Based Network Access Control) Switch Port Security Configuration on Cisco Packet Tracer Switch Port Security Extended Access List Configuration With Packet Tracer Standard Access List Configuration With Packet Tracer Basic Cisco Router Security Configuration Automation and Programmability Ansible vs Puppet vs Chef Generative AI vs Predictive AI Chef Overview Puppet Overview Ansible Overview Network Automation Tools Interpret JSON Encoded Data Cisco DNA Center Cisco SD-Access Data Serialization Languages: JSON, YAML, XML Traditional Network Management versus Cisco DNA Center Cisco DNA and Intent-Based Networking (IBN) How Network Automation Impacts Network Management REST APIs SDN (Software Defined Networking) What is SDN ? Traditional Network Drawbacks Versus SDN What Will SDN Bring? SDN Architecture Components SDN Terminology Virtualization Virtual Network Structure Cloud Computing Basics Cisco ACI Virtualization Latest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024",
      "source_url": "https://ipcisco.com/lesson/vlans-virtual-local-area-networks/",
      "source_category": "networking_tutorials",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "What is a VLAN?",
        "VLAN Definition",
        "Collision and Broadcast Domains",
        "VLANs What is it?",
        "What is Native VLAN?",
        "Cisco VLAN Example",
        "Setting IP Addresses",
        "Creating VLANes",
        "Setting Access Ports and Assigning VLANs",
        "Setting Trunk Ports and Allowing VLANs"
      ],
      "content_length": 3989,
      "created_at": "2025-09-04T01:50:46.365908"
    },
    {
      "case_id": "BATCH_EXPERT_0005",
      "title": "Expert Knowledge: OSPF Routing Protocol Overview - Study CCNA",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "OSPF (Open Shortest Path First) is an Interior Gateway Protocol (IGP). It is a link-state routing protocol that uses the Shortest Path First (SPF) algorithm to calculate the best route. OSPF routing protocol is an open standard, so various network vendors implement it. Here are the most important features of OSPF: A classless routing protocol Supports VLSM, CIDR, manual route summarization, equal cost load balancing Incremental updates are supported Uses only one parameter as the metric – the interface cost. The administrative distance of OSPF routes is, by default, 110. Uses multicast addresses 224.0.0.5 and 224.0.0.6 for routing updates. Routers running OSPF protocol have to establish neighbor relationships before exchanging routes. Becau...",
      "full_content": "OSPF (Open Shortest Path First) is an Interior Gateway Protocol (IGP). It is a link-state routing protocol that uses the Shortest Path First (SPF) algorithm to calculate the best route. OSPF routing protocol is an open standard, so various network vendors implement it. Here are the most important features of OSPF: A classless routing protocol Supports VLSM, CIDR, manual route summarization, equal cost load balancing Incremental updates are supported Uses only one parameter as the metric – the interface cost. The administrative distance of OSPF routes is, by default, 110. Uses multicast addresses 224.0.0.5 and 224.0.0.6 for routing updates. Routers running OSPF protocol have to establish neighbor relationships before exchanging routes. Because OSPF is a link-state routing protocol, neighbors don’t exchange routing tables. Instead, they exchange information about network topology. Each OSPF router then runs SPF or Dijkstra algorithm to calculate the best routes and adds those to the routing table. Because each router knows the entire topology of a network, the chance for a routing loop to occur is minimal. Each OSPF router stores routing and topology information in three tables: Neighbor table – stores information about OSPF neighbors Topology table – stores the topology structure of a network Routing table – stores the best routes OSPF Neighbors OSPF routers need to establish a neighbor relationship before exchanging routing updates. OSPF neighbors are dynamically discovered by sending Hello packets from each OSPF-enabled interface on a router. Hello packets are sent to the multicast IP address of 224.0.0.5. The process is explained in the following figure: Routers R1 and R2 are directly connected. After OSPF is enabled, both routers send Hellos to establish a neighbor relationship. You can verify that the neighbor relationship has been established by typing the ‘show ip ospf neighbors’ command. R1#show ip ospf neighbor Neighbor ID Pri State Dead Time Address Interface 2.2.2.2 1 FULL/DR 00:00:30 192.168.0.2 FastEthernet0/0 In the example above, you can see that the router-id of R2 is 2.2.2.2. Each OSPF router is assigned a router ID. A router ID is determined by using one of the following: 1. Using the router-id command under the OSPF process. 2. Using the highest IP address of the router’s loopback interfaces. 3. Using the highest IP address of the router’s physical interfaces. The following fields in the Hello packets must be the same on both routers in order for routers to become neighbors: subnet area id hello and dead interval timers authentication area stub flag MTU By default, OSPF sends hello packets every 10 seconds on an Ethernet network (Hello interval). A dead timer is four times the value of the hello interval, so if a router on an Ethernet network doesn’t receive at least one Hello packet from an OSPF neighbor for 40 seconds, the router declares that neighbor to be down. OSPF Neighbor States Before establishing a neighbor relationship, OSPF routers need to go through several state changes. These states are explained below: 1. Init state – a router has received a Hello message from the other OSPF router 2. 2-way state – the neighbor has received the Hello message and replied with a Hello message of his own 3. Exstart state – beginning of the Link State Database (LSDB) exchange between both routers. Routers are starting to exchange link state information. 4. Exchange state – DBD (Database Descriptor) packets are exchanged. DBDs contain LSAs headers. Routers will use this information to see what LSAs need to be exchanged. 5. Loading state – one neighbor sends LSRs (Link State Requests) for every network it doesn’t know about. The other neighbor replies with the LSUs (Link State Updates), which contain information about requested networks. After all the requested information have been received, other neighbor goes through the same process 6. Full state – both routers have the synchronized database and are fully adjacent to each other. NOTE Depending on the network, OSPF can elect a Designated Router (DR) and a Backup Designated Router (BDR). DR and BDR serve as the central point for exchanging OSPF routing information. OSPF Routing Protocol Areas OSPF uses the concept of areas. An area is a logical grouping of contiguous networks and routers. All routers in the same area have the same topology table, but they don’t know about routers in the other areas. The main benefits of creating areas are that the size of the topology and the routing table on a router is reduced, less time is required to run the SPF algorithm, and routing updates are also reduced. Each area in the OSPF network has to connect to the backbone area (area 0). All routers inside an area must have the same area ID to become OSPF neighbors. A router with interfaces in more than one area (area 0 and area 1, for example) is called Area Border Router (ABR). A router that connects an OSPF network to other routing domains (EIGRP network, for example) is called Autonomous System Boundary Router (ASBR). NOTE In OSPF, manual route summarization is possible only on ABRs and ASBRs. To better understand the concept of OSPF areas, consider the following example. All routers are running OSPF. Routers R1 and R2 are inside the backbone area (area 0). Router R3 is an ABR because it has interfaces in two areas, namely Area 0 and Area 1. Routers R4 and R5 are inside Area 1. Router R6 is an ASBR because it connects the OSPF network to another routing domain (an EIGRP domain in this case). If the R1’s directly connected subnet fails, router R1 sends the routing update only to R2 and R3 because all routing updates are localized inside the area. NOTE The role of an ABR is to advertise address summaries to neighboring areas. The role of an ASBR is to connect an OSPF routing domain to another external network (e.g. Internet, EIGRP network…). LSA, LSU, and LSR OSPF routers use the LSAs (Link-State Advertisements) to exchange topology information. Each LSA contains routing and topology information to describe a part of an OSPF network. When two neighbors decide to exchange routes, they send each other a list of all LSAs in their respective topology databases. Each router then checks its topology database and sends a Link State Request (LSR) message requesting all LSAs not found in its topology table. The other router responds with the Link State Update (LSU) containing all LSAs the other neighbor requested. The concept is explained in the following example: After configuring OSPF on both routers, routers exchange LSAs to describe their topology database. Router R1 sends an LSA header for its directly connected network 10.0.1.0/24. Router R2 checks its topology database and determines that it doesn’t have information about that network. Router R2 then sends a Link State Request message requesting further information about that network. Router R1 responds with Link State Update, which contains information about subnet 10.0.1.0/24, such as next hop address, cost, etc. Download our Free CCNA Study Guide PDF for complete notes on all the CCNA 200-301 exam topics in one book. We recommend the Cisco CCNA Gold Bootcamp as your main CCNA training course. It’s the highest rated Cisco course online with an average rating of 4.8 from over 30,000 public reviews and is the gold standard in CCNA training:",
      "source_url": "https://study-ccna.com/ospf-overview/",
      "source_category": "study_resources",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "OSPF Neighbors",
        "OSPF Neighbor States",
        "OSPF Routing Protocol Areas",
        "LSA, LSU, and LSR"
      ],
      "content_length": 7377,
      "created_at": "2025-09-04T01:50:46.366155"
    },
    {
      "case_id": "BATCH_EXPERT_0006",
      "title": "Expert Knowledge: EIGRP Routing Protocol Overview - Study CCNA",
      "category": "BGP",
      "technology": "BGP Technology",
      "description": "NOTE EIGRP is not explicitly listed in the latest 200-301 version of the CCNA exam topics (whereas OSPF is) but you can still be tested on it in the exam. EIGRP (Enhanced Interior Gateway Routing Protocol) is an advanced distance vector routing protocol. This protocol is an evolution of an earlier Cisco protocol called IGRP, which is now considered obsolete. EIGRP supports classless routing and VLSM, route summarization, incremental updates, load balacing and many other useful features. It is a Cisco propriatery protocol, so all routers in a network that is running EIGRP must be Cisco routers. Routers running EIGRP must become neighbors before exchanging routing information. To dynamically discover neighbors, EIGRP routers use the multicast...",
      "full_content": "NOTE EIGRP is not explicitly listed in the latest 200-301 version of the CCNA exam topics (whereas OSPF is) but you can still be tested on it in the exam. EIGRP (Enhanced Interior Gateway Routing Protocol) is an advanced distance vector routing protocol. This protocol is an evolution of an earlier Cisco protocol called IGRP, which is now considered obsolete. EIGRP supports classless routing and VLSM, route summarization, incremental updates, load balacing and many other useful features. It is a Cisco propriatery protocol, so all routers in a network that is running EIGRP must be Cisco routers. Routers running EIGRP must become neighbors before exchanging routing information. To dynamically discover neighbors, EIGRP routers use the multicast address of 224.0.0.10. Each EIGRP router stores routing and topology information in three tables: Neighbor table – stores information about EIGRP neighbors Topology table – stores routing information learned from neighboring routers Routing table – stores the best routes Administrative distance of EIGRP is 90, which is less than both the administrative distance of RIP and the administrative distance of OSPF, so EIGRP routes will be preferred over these routes. EIGRP uses Reliable Transport Protocol (RTP) for sending messages. EIGRP calculates its metric by using bandwidth, delay, reliability and load. By default, only bandwidth and delay are used when calulating metric, while reliability and load are set to zero. EIGPR uses the concept of autonomous systems. An autonomous system is a set of EIGRP enabled routers that should become EIGRP neighbors. Each router inside an autonomous system must have the same autonomous system number configured, otherwise routers will not become neighbors. EIGRP Neighbors EIGRP must establish neighbor relationships with other EIGRP neighboring routers before exchanging routing information. To establish a neighbor relationships, routers send hello packets every couple of seconds. Hello packets are sent to the multicast address of 224.0.0.10. NOTE On LAN interfaces hellos are sent every 5 seconds. On WAN interfaces every 60 seconds. The following fields in a hello packet must be the identical in order for routers to become neighbors: ASN (autonomous system number) subnet number K values (components of metric) Routers send hello packets every couple of seconds to ensure that the neighbor relationship is still active. By default, routers considers the neighbor to be down after a hold-down timer has expired. Hold-down timer is, by default, three times the hello interval. On LAN network the hold-down timer is 15 seconds. Feasible and reported distance Two terms that you will often encounter when working with EIGRP are feasible and reported distance. Let’s clarify these terms: Feasible distance (FD) – the metric of the best route to reach a network. That route will be listed in the routing table. Reported distance (RD) – the metric advertised by a neighboring router for a specific route. It other words, it is the metric of the route used by the neighboring router to reach the network. To better understand the concept, consider the following example. EIGRP has been configured on R1 and R2. R2 is directly connected to the subnet 10.0.1.0/24 and advertises that subnet into EIGRP. Let’s say that R2’s metric to reach that subnet is 28160. When the subnet is advertised to R1, R2 informs R1 that its metric to reach 10.0.1.0/24 is 28160. From the R1’s perspective that metric is considered to be the reported distance for that route. R1 receives the update and adds the metric to the neighbor to the reported distance. That metric is called the feasible distance and is stored in R1’s routing table (30720 in our case). The feasible and reported distance are displayed in R1’s EIGRP topology table: R1#show ip eigrp topology IP-EIGRP Topology Table for AS 1/ID(192.168.0.1) Codes: P - Passive, A - Active, U - Update, Q - Query, R - Reply, r - Reply status P 10.0.1.0/24, 1 successors, FD is 30720 via 192.168.0.2 (30720/28160), FastEthernet0/0 P 192.168.0.0/24, 1 successors, FD is 28160 via Connected, FastEthernet0/0 Successor and feasible successor Another two terms that appear often in the EIGRP world are successor and feasible successor. A successor is the route with the best metric to reach a destination. That route is stored in the routing table. A feasible successor is a backup path to reach that same destination that can be used immediately if the successor route fails. These backup routes are stored in the topology table. For a route to be chosen as a feasible successor, one condition must be met: the neighbor’s advertised distance (AD) for the route must be less than the successor’s feasible distance (FD). The following example explains the concept of a successor and a feasible successor. R1 has two paths to reach the subnet 10.0.0.0/24. The path through R2 has the best metric (20) and it is stored in the R1’s routing table. The other route, through R3, is a feasible successor route, because the feasiblility condition has been met (R3’s advertised distance of 15 is less than R1’s feasible distance of 20). R1 stores that route in the topology table. This route can be immediately used if the primary route fails. EIGRP topology table EIGRP toplogy table contains all learned routes to a destination. The table holds all routes received from a neighbor, successors and feasible successors for every route, and interfaces on which updates were received. The table also holds all locally connected subnets included in an EIGRP process. Best routes (the successors) from the topology table are stored in the routing table. Feasible successors are only stored in the topology table and can be used immediately if the primary route fails. Consider the following network topology. EIGRP is running on all three routers. Routers R2 and R3 both connect to the subnet 10.0.1.0/24 and advertise that subnet to R1. R1 receives both updates and calulates the best route. The best path goes through R2, so R1 stores that route in the routing table. Router R1 also calculates the metric of the route through R3. Let’s say that advertised distance of that route is less then feasible distance of the best route. The feasibility condition is met and router R1 stores that route in the topology table as a feasible successor route. The route can be used immediately if the primary route fails. Download our Free CCNA Study Guide PDF for complete notes on all the CCNA 200-301 exam topics in one book. We recommend the Cisco CCNA Gold Bootcamp as your main CCNA training course. It’s the highest rated Cisco course online with an average rating of 4.8 from over 30,000 public reviews and is the gold standard in CCNA training:",
      "source_url": "https://study-ccna.com/eigrp-overview/",
      "source_category": "study_resources",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "EIGRP Neighbors",
        "Feasible and reported distance",
        "Successor and feasible successor",
        "EIGRP topology table"
      ],
      "content_length": 6752,
      "created_at": "2025-09-04T01:50:46.366343"
    },
    {
      "case_id": "BATCH_EXPERT_0008",
      "title": "Expert Knowledge: Initial Access, Tactic TA0001 - Enterprise | MITRE ATT&CK®",
      "category": "General Networking",
      "technology": "General Networking Technology",
      "description": "Home Tactics Enterprise Initial Access Initial Access The adversary is trying to get into your network.Initial Access consists of techniques that use various entry vectors to gain their initial foothold within a network. Techniques used to gain a foothold include targeted spearphishing and exploiting weaknesses on public-facing web servers. Footholds gained through initial access may allow for continued access, like valid accounts and use of external remote services, or may be limited-use due to changing passwords. ID: TA0001 Created: 17 October 2018 Last Modified: 25 April 2025 Version Permalink Live Version TechniquesTechniques: 11 ID Name Description T1659 Content Injection Adversaries may gain access and continuously communicate with vi...",
      "full_content": "Home Tactics Enterprise Initial Access Initial Access The adversary is trying to get into your network.Initial Access consists of techniques that use various entry vectors to gain their initial foothold within a network. Techniques used to gain a foothold include targeted spearphishing and exploiting weaknesses on public-facing web servers. Footholds gained through initial access may allow for continued access, like valid accounts and use of external remote services, or may be limited-use due to changing passwords. ID: TA0001 Created: 17 October 2018 Last Modified: 25 April 2025 Version Permalink Live Version TechniquesTechniques: 11 ID Name Description T1659 Content Injection Adversaries may gain access and continuously communicate with victims by injecting malicious content into systems through online network traffic. Rather than luring victims to malicious payloads hosted on a compromised website (i.e., Drive-by Target  Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes. In the case of Lateral Movement, this may occur through modification of executable files stored on removable media or by copying malware and renaming it to look like a legitimate file to trick users into executing it on a separate system. In the case of Initial Access, this may occur through manual manipulation of the media, modification of systems used to initially format the media, or modification to the media's firmware itself. T1195 Supply Chain Compromise Adversaries may manipulate products or product delivery mechanisms prior to receipt by a final consumer for the purpose of data or system compromise. .001 Compromise Software Dependencies and Development Tools Adversaries may manipulate software dependencies and development tools prior to receipt by a final consumer for the purpose of data or system compromise. Applications often depend on external software to function properly. Popular open source projects that are used as dependencies in many applications may be targeted as a means to add malicious code to users of the dependency. .002 Compromise Software Supply Chain Adversaries may manipulate application software prior to receipt by a final consumer for the purpose of data or system compromise. Supply chain compromise of software can take place in a number of ways, including manipulation of the application source code, manipulation of the update/distribution mechanism for that software, or replacing compiled releases with a modified version. .003 Compromise Hardware Supply Chain Adversaries may manipulate hardware components in products prior to receipt by a final consumer for the purpose of data or system compromise. By modifying hardware or firmware in the supply chain, adversaries can insert a backdoor into consumer networks that may be difficult to detect and give the adversary a high degree of control over the system. Hardware backdoors may be inserted into various devices, such as servers, workstations, network infrastructure, or peripherals. T1199 Trusted Relationship Adversaries may breach or otherwise leverage organizations who have access to intended victims. Access through trusted third party relationship abuses an existing connection that may not be protected or receives less scrutiny than standard mechanisms of gaining access to a network. T1078 Valid Accounts Adversaries may obtain and abuse credentials of existing accounts as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Compromised credentials may be used to bypass access controls placed on various resources on systems within the network and may even be used for persistent access to remote systems and externally available services, such as VPNs, Outlook Web Access, network devices, and remote desktop. Compromised credentials may also grant an adversary increased privilege to specific systems or access to restricted areas of the network. Adversaries may choose not to use malware or tools in conjunction with the legitimate access those credentials provide to make it harder to detect their presence. .001 Default Accounts Adversaries may obtain and abuse credentials of a default account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Default accounts are those that are built-into an OS, such as the Guest or Administrator accounts on Windows systems. Default accounts also include default factory/provider set accounts on other types of systems, software, or devices, including the root user account in AWS, the root user account in ESXi, and the default service account in Kubernetes. .002 Domain Accounts Adversaries may obtain and abuse credentials of a domain account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Domain accounts are those managed by Active Directory Domain Services where access and permissions are configured across systems and services that are part of that domain. Domain accounts can cover users, administrators, and services. .003 Local Accounts Adversaries may obtain and abuse credentials of a local account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Local accounts are those configured by an organization for use by users, remote support, services, or for administration on a single system or service. .004 Cloud Accounts Valid accounts in cloud environments may allow adversaries to perform actions to achieve Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Cloud accounts are those created and configured by an organization for use by users, remote support, services, or for administration of resources within a cloud service provider or SaaS application. Cloud Accounts can exist solely in the cloud; alternatively, they may be hybrid-joined between on-premises systems and the cloud through syncing or federation with other identity sources such as Windows Active Directory. T1669 Wi-Fi Networks Adversaries may gain initial access to target systems by connecting to wireless networks. They may accomplish this by exploiting open Wi-Fi networks used by target devices or by accessing secured Wi-Fi networks — requiring Valid Accounts — belonging to a target organization. Establishing a connection to a Wi-Fi access point requires a certain level of proximity to both discover and maintain a stable network connection.",
      "source_url": "https://attack.mitre.org/tactics/TA0001/",
      "source_category": "cybersecurity_resources",
      "quality_score": 88,
      "confidence": 85,
      "expert_level": "intermediate",
      "keywords": [],
      "headings": [
        "Initial Access",
        "Techniques"
      ],
      "content_length": 6552,
      "created_at": "2025-09-04T01:50:46.367048"
    }
  ]
}