[
  {
    "case_id": "EXPERT_NET_001",
    "title": "Expert Knowledge: BGP Protocol | Border Gateway Protocol | Autonomous Systems ⋆",
    "category": "BGP",
    "technology": "BGP Routing Protocol",
    "description": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Mult...",
    "full_content": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Multicast Course SDN Course Video Courses CCNA 200-301 Labs HCIA Configuration Course NRS I Configuration Course CCNP 350-401 ENCOR Labs Cisco Packet Tracer How To Guide Online Courses Udemy Courses SPECIALS All Quizes CCNA Flashcard Questions Cheat Sheets Protocol Cheat Sheets Subnetting Cheat Sheet Linux Cheat Sheet Python Cheat Sheet CLI Commands Cheat Sheets Miscellaneous Cheat Sheets Network Labs Cisco Packet Tracer Labs Cisco GNS3 Labs Huawei eNSP Labs Nokia GNS3 Labs Short Config Videos Network Tools IPCisco on Social Media Network Engineer Interview Questions Personality Interview Training BLOG MEMBERS Sign In/Up | Members Lost password Sign In/Sign Up SHOP ABOUT About Contact References Donation ENROLL HERE Table of Contents Toggle What is BGP Protocol? There are different routing protocols used in networking. In this BGP Tutorial, we will focus on the protocol of Internet, BGP. Commonly, we can divide these routing protocols into two types according to the place that we use them. These routing protocols are IGP (Interior Gateway Protocols) and EGP (Exterior Gateway Protocols). If we use a routing protocol inside of our network, it is IGP. If we use them outside of our network, it is EGP. In the previous lessons, we have talked about different IGPs. In this lesson, we will talk about the only EGP used today. This is the protocol of Internet, BGP Protocol, Border Gateway Protocol. By the way, here we will focus on the overview of Border Gateway Protocol. We will focus on advanced lessons like BGP Communities, BGP Filtering, BGP Convergence on the related lessons. Border Gateway Protocol (BGP) was developed by IETF (Internet Engineering Task Force). It is known as the global routing protocol of Internet today. Because BGP routes the traffic across internet and between different service providers. It is the most scalable routing protocol today. Why We Use BGP? BGP is mainly a routing protocol. Here, you can think about that, why can’t we use other routing protocols over internet? Why we need BGP on Internet? The answer of this question is the importance of the BGP. Let’s explain deeply. Internet is a large network and consist of many organizations. For such large networks, redundancy and load balancing is very important. For example, a large organization can need one more internet connection with different Public IP addresses. Another one can have one more connection and wants to use one link more than others with load balancing. These detailed services cannot be done easily by a routing protocol. Border Gateway Protocol overcomes these issues by itself. We can use redundancy and load balancing services effectively with BGP. To do this, we have a high control over BGP path selection. We can use different BGP Path attributes to manipulate path selection. With this manipulation, optimum path and traffic policy for an organization is determined. Basically, BGP is responsible to determine the optimum path and by hoping between autonomous systems, it delivers the required data across Internet. What was the main difference between an IGP and an EGP? Well known IGPS are RIP, OSPF, EIGRP, IS-IS. These routing protocols give us the ability to route the traffic within an Autonomous System. In other words, we use IGPs inside our network but it is not feasible to use these protocols on a large network like Internet. But EGP allow us to route the traffic between ASs (Autonomous Systems). BGP is an Exterior Gateway Protocol (EGP). BGP routes the Internet traffic between Autonomous Systems. We can say that, internet is the collection of connected ASs. So, BGP is also known as Internet Protocol. You can test your BGP Knowledge on BGP Practice Tests Page! There are many corporates like Cisco, Huawei, Juniper and Nokia on internet and they have their own AS numbers. And internet is collection of these Autonomous Systems. Internet Consist of Autonomous Systems So, what is an Autonomous System? What is ASN? What is Autonomous System (AS) & AS Number (ASN)? An Autonomous System (AS) is a network or a collection of networks that are under a single entity or organization management. And the Internet is the collection of ASs. Service Providers and large companies has their own Autonomous Systems and they are known with their ASN by the other Service Providers. ASs has their own numbers for identification. These numbers are called Autonomous System Numbers, ASNs. Firstly, Internet Assigned Numbers Authority (IANA) assigns these AS numbers to the Regional Internet Registries (RIRs) like RIPE, APNIC etc. And then, RIRS assign these AS numbers to the Internet Service Providers or other large organizations. These organizations can be a tech company, a university, a government agency etc. ASN is a 16-bit number and they can be any value between 1 and 65535. This ASN block can be divided into two: 1 – 64511 Public ASNs 64512-65535 Private ASNs 1 to 64511 ASNs are globally unique Public ASNs. They belong to specific organizations or Internet Service Providers. So, one of these addresses can only be used by these specific organization. IANA assign these ASNs to Regional Internet Registries and then they assign these ASNs to specific Internet Service Providers or large organizations like Cisco, Juniper, Nokia, Huawei etc. 4512 to 6553 ASNs are Private ASNs. These range can not be used on Internet but they can be used by everyone. They are like private IP addresses. For example, they can be used for BGP confederations within an autonomous system. Inside an Autonomous System, we use IGP as I mentioned before. How about between Autonomous Systems on Internet? Between Autonomous Systems, EGPs (Exterier Gateway Protocols) are used. And today, there is only one EGP. This is Border Gateway Protocol (BGP). Before, there was also a protocol named EGP (same name). But it is retired. By the way during BGP configuration, one router can belong to only one Autonomous System. So, we can configure BGP on a router with only one ASN. To learn Regional Internet Registry ASNs assigned by IANA you can check the following link: IANA, Assigned AS Numbers You can check the companies and their assigned ASNs on internet. You can test your BGP Knowledge on BGP Practice Tests Page! General BGP Protocol Properties Path Vector Protocol Border Gateway Protocol (BGP) is a Path Vector protocol. So, it has both Link-State and Distance-Vector protocols characteristics. BGP is slower than other Routing Protocols. Because it does Route exploration. According to different policies, BGP select the optimum path for the traffic. And with different path attributes, we can always manipulate BGP Path Selection and we have a high control over routing. Runs Over TCP BGP uses TCP (Transmission Control Protocol) for session establishment. So, it is a secure protocol. For BGP neighborship, firstly, TCP Three-Way Handshake Mechanism works and TCP Connection is established. For this connection, SYN, ACK and SYN ACK messages of TCP is used. After a proper connection, other BGP session establishment processes are done. We will talk about BGP Session Establishment detailly in the next lesson. As you know, protocols use some default port numbers. BGP also uses one of these default port numbers. BGP uses TCP 179 port by default. Supports CIDR Border Gateway Protocol supports CIDR (Classless Inter-Domain Routing). BGP Tables BGP uses three tables for BGP routing. These tables are given below: Neighbor Table BGP Table Routing Table BGP Neighbor Table includes BGP neighbors of the router. All BGP Peers showed in BGP Neighbor Table. BGP Table includes the updates that received from other BGP devices. Routing Table includes the Best Routes to the destination. EBGP & IBGP BGP is one routing protocol but we can divide it into two according to the used location. These are: EBGP (Exterior Border Gateway Protocol) IBGP (Interior Border Gateway Protocol) We use BGP as EBGP (Exterior Border Gateway Protocol) between Autonomous Systems. Two routers in different Autonomous Systems establish BGP Neighborship with EBGP. On the other hand, IBGP (Interior Border Gateway Protocol) is used within the Autonomous System. If two BGP router in the same AS establish a BGP neighborship, this is IBGP neighborship. BGP Administrative Distance For Cisco devices, there are two default BGP Administrative Distance (Preference) for EBGP and IBGP. The default administrative distance value for EBGP is 20. The default administrative distance value for IBGP is 200. For Cisco devices, EBGP Routes are very trustful. So, its AD value is lower than any well-known routing protocols like RIP, OSPF, EIGRP. These are the values used by Cisco for BGP Routes. How about other vendors like Juniper, Huawei, Nokia? Nokia, Juniper and Huawei do not divide preference values into two like Cisco. Nokia and Juniper use 170 as BGP default administrative distance. And Huawei uses 255 as BGP preference. Supports Policies BGP gives us high control opportunity on traffic. To do this, iBGP supports policies. Different policies can be used for different types of traffic. So, we can distinguish traffics and behave different towards different traffic. BGP Best Path Algorithm BGP selects the Best Path according to BGP Best Path Algorithm. There are different BGP Path Attributes which is used on this Best Path Algorithm. BGP checks this orderly and determine the optimum path. We will talk about BGP path attributes detailly in the following lessons. Manipulate Traffic with Path Attributes With Border Gateway Protocol, we can manipulate traffic and we can have more control on routing. By the help of BGP Path Attributes, we can determine the paths and their load ratios. Using BGP Attributes provides redundancy mechanism and load balancing. BGP Neighborship Establishment A Router needs to connect another router with BGP for BGP operation. This is BGP neighborship establishment. BGP uses TCP Three-Way Handshake for BGP Neighborship. BGP Neighborship establishment is a set of states. Each state uses different messages. At the beginning, the state is Idle. After that for BGP peering different states are passed. These are given below: Connect Open Sent Open Confirm Established There is also another state named Active. This means that there is a problem on BGP Neighborship. BGP Messages Border Gateway Protocol uses different message types for its neighborship establishment and routing updates. We will talk about these BGP messages detailly in another lesson but here, let’s write down these messages: Open messages Update messages Keepalieve messages Notification messages Summary BGP is the most important protocol for Internet. Network engineers like to work on BGP a lot. Because, working on BGP Protocol is also an indicator of your networking experience. Always, the most experienced network engineers work on Border Gateway Protocol. Here, we have talked about basic BGP characteristics. In other lessons, we will go through BGP deeply and learn the details of the protocol of Internet like BGP Communities, BGP Filtering, BGP Convergence etc. We will also learn how to configure BGP with different BGP Protocol Examples. Become a Member! Lesson tags: routing, BFP Back to: CCNP Enterprise 350-401 ENCOR v1.1 > BGP Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Name * Email * Website Comment * Δ Previous Next Collapse Expand IPv4 IPv4 Subnetting Private IPv4 Address Ranges APIPA Addresses IPv4 Addressing IPv6 IPv6 Addressing IPv6 Link Local Addresses IPv6 Neighbour Discovery Protocol IPv6 Floating Static Routing IPv6 Address Types IPv6 Configuration Example on Packet Tracer IPv6 and Subnetting ICMP and ARP Ping Command Gratuitous ARP Proxy ARP ICMP (Internet Control Message Protocol) Address Resolution Protocol (ARP) Routing Fundamentals IPv6 Static Route Configuration on Cisco IOS Policy Based Routing (PBR) Static Route Configuration on Cisco Routers IPv6 Routing Protocols Dynamic Routing Protocols IP and Layer 3 Overview RIP RIPng Configuration Example on Cisco IOS RIP Configuration With Packet Tracer RIPng (RIP Next Generation) Routing Information Protocol (RIP) EIGRP EIGRP (Enhanced Interior Gateway Routing Protocol) EIGRP vs OSPF EIGRP Tables EIGRP Packet Types and Neighbourship Key Configurations on EIGRP EIGRP Configuration With Packet Tracer EIGRP for IPv6 EIGRP For IPv6 Configuration On Cisco IOS OSPF OSPF Virtual-Link Configuration On Packet Tracer OSPF Passive Interface LSDB (Link State Database) OSPF Area Border Router (ABR) and ASBR OSPF Cost and Shortest Path First OSPF NSSA and Totally NSSA on Cisco Packet Tracer OSPF Stub Area and Totally-Stub Area on Cisco Packet Tracer OSPF External Routes on Cisco Packet Tracer OSPF Standard Area and Backbone Area on Cisco Packet Tracer OSPFv3 Configuration Example on Cisco IOS OSPFv3 (Open Shortest Path First Version 3) Cisco Single Area OSPF Configuration Other OSPF Key Points OSPF Network Types OSPF Area Types OSPF LSA Types OSPF Packet Types OSPF Adjacency OSPF(Open Shortest Path First) Overview BGP BGP Next Hop Self Command OSPF vs BGP BGP Multi Hop Command BGP Neighbor Update-Source Cisco eBGP Configuration on GNS3 BGP Route Reflector Cisco BGP Route Reflector Configuration on GNS3 BGP Path Attributes - MED BGP Path Attributes - Origin BGP Path Attributes - AS Path BGP Path Attributes - Local Preference BGP Path Attributes - Weight BGP Configuration Example on Packet Tracer BGP AD and BGP Path Attributes IBGP and EBGP BGP Peers, BGP Sessions, BGP Messages BGP (Border Gateway Protocol) Layer 2 Technologies PPPoE Configuration With Packet Tracer Metro Ethernet Overview Frame-Relay Configuration with both Inverse-ARP and Frame-Relay Map Frame Relay Point-to-Point Configuration Multipoint Frame Relay Configuration Point-to-Point Protocol over Ethernet (PPPoE) HDLC and PPP PPP Configuration on Cisco VPN Technologies VPN Types and Protocols of VPN DHCP and DNS Cisco DHCP Relay Agent Configuration with GNS3 Stateless Address Auto Configuration DHCPv6 Overview EtherChannels Etherchannel Cisco PAgP Configuration on GNS3 PAgP Configuration Example LACP Configuration on Cisco IOS Link Aggregation Control Protocol NAT PAT Configuration with Packet Tracer NAT (Network Address Translation) Static NAT Configuration with Packet Tracer Dynamic NAT Configuration with Packet Tracer Access Lists Extended ACL Cisco Configuration Access Control Lists for Traffic Control Standard ACL Configuration With Packet Tracer Security DHCP Snooping Configuration on Packet Tracer REST API Security Cisco 802.1x Configuration WebAuth (Web Authentication) What is DHCP Snooping? Access Control Lists Control Plane Policing (CoPP) Basic Cisco Router Security Configuration SNMP SNMP Configuration On Cisco IOS SNMP – Overview Spanning Tree PVST+ and Rapid PVST+Configuration on Packet Tracer PVST+ and Rapid PVST+ MST Configuration on Cisco MST (Multiple Spanning Tree) STP Operation Spanning Tree Protocol Rapid Spanning Tree Protocol STP Portfast Configuration on Cisco Packet Tracer RSTP Configuration on Cisco Packet Tracer STP Configuration on Cisco Packet Tracer VLANs Switch Virtual Interface Configuration on Packet Tracer Inter VLAN Routing Configuration on GNS3 Inter VLAN Routing Configuration Example VTP Configuration with Packet Tracer DTP and VLAN Frame Tagging Protocols Inter VLAN Routing with Router on Stick Topology VLANs (Virtual Local Area Networks) VLAN Port Assignment and VLAN Port Types VLAN Configuration on Cisco Packet Tracer First Hop Redundancy HSRP Configuration on GNS3 Cisco Stateful Switchover (SSO) GLBP Configuration on Cisco GLBP (Gateway Load Balancing Protocol) VRRP Configuration on Cisco VRRP (Virtual Router Redundancy Protocol) HSRP (Hot Standby Router Protocol) First Hop Redundancy Protocols QoS QoS Policing and Shaping QoS Classification and Marking QoS Port Monitor ERSPAN Configuration on Packet Tracer Remote SPAN Configuration on Packet Tracer Local SPAN Configuration on Packet Tracer Cisco SPAN Overview Path Virtualization IPSec Tunneling Cisco IPSec VPN Configuration Cisco Virtual Routing and Forwarding (VRF) GRE Tunnel Overview GRE Tunnel Configuration with Cisco Packet Tracer Device Access Control Cisco SSH Configuration With GNS3 TACACS+ RADIUS Authentication, Authorization, Accounting AAA Protocols Multicast Protocols Bidirectional PIM (BIDIR-PIM) Multicast Routing IGMPv3 PIM-SM (PIM Sparse Mode) PIM-SSM (Source Specific Multicast) PIM-DM (PIM Dense Mode) PIM (Protocol Independent Multicast) IGMP Snooping IGMP Configuration IGMP Cisco SD-WAN Cisco SD-WAN Verification Cisco vSmart Controller Configuration Cisco vBond Initial Configuration Cisco SD-WAN Components SD-WAN Architecture Wireless Security EAPoL (Extensible Authentication Protocol over LAN) Pre-Shared Key (PSK) Network Security Design 802.1x (Port Based Network Access Control) Network Security: Cisco Threat Defense MACsec (Media Access Control Security) Cisco TrustSec MAC Authentication Bypass (MAB) IP Services Cisco NTP Configuration uRPF (Unicast Reverse Path Forwarding) Precision Time Protocol (PTP) NTP (Network Time Protocol) Network Assurance Cisco Syslog Server Configuration with GNS3 Cisco RESTCONF Configuration Cisco NETCONF Configuration NETCONF Operation Steps NETCONF Protocol Stack NETCONF Overview RESTCONF Conditional debugging Cisco Terminal Monitor and Cisco Logging Monitor Cisco Debug Command Cisco IP SLA and Configuration Flexible Netflow Configuration Flexible Netflow Netflow and Netflow Configuration Automation Chef Overview Ansible vs Puppet vs Chef Ansible Overview Puppet Overview Data Serialization Languages: JSON, YAML, XML Network Automation Tools Cisco SD-Access Overview Traditional Network Management versus Cisco DNA Center Cisco DNA Center Cisco DNA and Intent-Based Networking (IBN) How Network Automation Impacts Network Management REST APIs Overview Network Virtualization Cisco LISP (Locator ID Separation Protocol) Virtual Switching and Virtual Switch (vSwitch) Container vs Virtual Machine Virtual Extensible LAN (VXLAN) Wireless CAPWAP versus LWAPP Wireless Roaming: Layer 2 and Layer 3 Roaming LWAPP Protocol CAPWAP Protocol Access Point Discovery and Join Process Other Lessons Network Ports SearchSearchLatest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024 WHAT YOU WILL FIND? 250.000+ Students All Over The World 8.000+ Questions & Answers 100+ Lab Files & Cheat Sheets 30+ IT/Network Courses A Real Desire To Help You Daily Social Media Shares %100 Satisfaction COURSES CISCO Courses NOKIA Courses HUAWEI Courses JUNIPER Courses PYTHON Course KEY Courses VIDEO Courses UDEMY Courses SPECIALS All Quizes Cheat Sheets Configuration Files Interview Questions IPCisco On Social Media MEMBERSHIP Membership CONTACT Pärnu mnt. 139c – 14, 11317, Tallinn, Estonia info@ipcisco.com Copyright © 2018-2024 IPCisco Disclaimer Privacy Policy Distance Selling Contract",
    "source_url": "https://ipcisco.com/lesson/bgp-border-gateway-protocol/",
    "quality_score": 95,
    "confidence": 90,
    "expert_level": "advanced",
    "scraped_from": "IPcisco_BGP",
    "created_at": "2025-09-04T01:46:17.906259"
  },
  {
    "case_id": "EXPERT_NET_002",
    "title": "Expert Knowledge: OSPF (Open Shortest Path First) ⋆ IpCisco",
    "category": "BGP",
    "technology": "BGP Routing Protocol",
    "description": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Mult...",
    "full_content": "COURSES Cisco CCNA 200-301 v1.1 CCNA 200-301 Labs CCNP 350-401 ENCOR CCNP 350-401 ENCOR Labs CCNP 300-410 ENARSI CCIE Enterprise Infrastructure Cisco Packet Tracer Lab Course Nokia NRS I NRS II Nokia OSPF & IS-IS Course NRS II MPLS Course NRS II Service Architecture Nokia Configuration Course Nokia SRC Program Juniper JNCIA Junos JNCIS JNCIP JNCIE Huawei HCIA (HCNA) HCIA Configuration Course What is Huawei R&S Certification? Huawei ICT Certifications Python Course Key Courses IPv6 Course IP Multicast Course SDN Course Video Courses CCNA 200-301 Labs HCIA Configuration Course NRS I Configuration Course CCNP 350-401 ENCOR Labs Cisco Packet Tracer How To Guide Online Courses Udemy Courses SPECIALS All Quizes CCNA Flashcard Questions Cheat Sheets Protocol Cheat Sheets Subnetting Cheat Sheet Linux Cheat Sheet Python Cheat Sheet CLI Commands Cheat Sheets Miscellaneous Cheat Sheets Network Labs Cisco Packet Tracer Labs Cisco GNS3 Labs Huawei eNSP Labs Nokia GNS3 Labs Short Config Videos Network Tools IPCisco on Social Media Network Engineer Interview Questions Personality Interview Training BLOG MEMBERS Sign In/Up | Members Lost password Sign In/Sign Up SHOP ABOUT About Contact References Donation ENROLL HERE Table of Contents Toggle OSPFv2 Overview OSPF (Open Shortest Path First), is one of the most used Routing Protocol today. OSPF is a standard based Link-State routing protocol. It is a Classless routing protocol which do not send subnet masks with updates. So, it allows to use VLSM. Open Shortest Path First has similarities with the other Link-State routing protocol IS-IS but it differents from it in many points. Open Shortest Path First uses a special algorithm, Dijsktra Alogirthm for route calculations. In other words, it uses Shortest Path First (SPF) method and with this way, the routing calculation is done. In OSPF, both periodic and triggered updates are used. These updates are sent with LSA (Link State Advertisements). There are also different OSPF packets used for the messaging between OSPF routers. OSPF is ideal for large networks and the convergence time of OSPF is very short. In other words, OSPF is a fast converged protocol. It is also prefered because of its secure character. As a hierarchical protocol, Open Shortest Path Firt divided into different Areas. This areas reduce the complexity of the network and opitmize routing tables. You can view detailed OSPF lessons below: Key Lessons: OSPF Adjacency Area Types Packet Types LSA Types Network Types OSPF Cost and SPF Algorithm Virtual Links, Authentication, Timers Areas & Configurations: Single Area OSPF Configuration Standard & Backbone Area Config Stub Area & Totally Stub Area Config NSSA & Totally NSSA Configuration OSPF External Routes OSPFv3 OSPFv3 OSPFv3 Configuration OSPF Tables Open Shortest Path First provides neighbourship between other OSFP routers by the help of OSPF messages. With these messages, OSPF tables are built. And Open Shortest Path First routing mechanims works with this tables. Basically, there are three tables in Open Shrtest Path First. These tables are: Neighboring Table Topology Table Routing Table Neighboring Table, is the table that stotres OSPF neighbor routers. You can see the directly connected OSFP neighbors here. Topoloji Table, is the view of OSPF network. It is also known as LSDB. All the Open Shortest Path First Router connections are stored here. Topology table is identical in all OSPF routers in the Open Shortst ath Firstnetwork. Routing Table, is the tablet hat stores the best paths to the destination. It is the table that is also sued with the other routing prtocols for routing process. In Open Shortest Path First, all routers build its own Topology Table and has the full view of the network. It calculates the next hope independently from other routers. This is also the characteristic of Link-State Protocols. As you remember, Link-State protocols are “OSPF” and “IS-IS”. In Distance-Vector protocols, the situation is not like this. Distance-Vector protocols needs a neighbor to know about the network. Open Shortest Path Fist routers announces the netwrok changes with LSAs eachother. LSDBs are built with these LSAs. The topology of the Open Shortest Path First network is stored in this LSDB (Link State Database). Hierarchical Design and Area Types Open Shortest Path First has an hierarchical architecture. It uses “Areas” for hieararcy. There is a Backbone Area as Area 0 in the center for all OSPF Networks. Around this Backbone Area, Area 0, there are some other Areas. All these areas are connected to this Area 0. If there is a uncontinuous structure, Virtual-Links can be used to connect an area to the Backbone Area (Area 0). With this hierachical architecture of Open Shortest Path First, you can divide your network into different small areas and by doing this, you can reduce overhead of this small areas. In other words, instead of doing LSDB processes for one large area, this is done in smaller areas and update summary LSAs are sent to the other areas. By doing this, LSA traffic is reduced. Beside Backbone Area and Normal Areas, there are alsom other area types in Open Shortest Path First network. You can find these area types below: Standard Area Backbone Area (Area 0) Stub Area Not So Stubby Area (NSSA) Totally Stub Area Totally NSSA In CCNA 200-301, there is only Single Area OSPF. So, we will not explain the other areas here. If you would like to learn OSPF Area types detailly, you can check the related lessons on CCNP ENCOR and CCIE Enterprise Infrastructure courses. OSPF Router Types In OSPF Design there are different Router types. These router types are named according to their roles and their place of the network. Let’s see these routers: Internal Routers: Routers in a Single Area. Backbone Routers: Routers in Backbone Area (Area 0) (At least one interface). Area Border Routers (ABRs): Routers have interfaces at least in two areas. Autonomus System Boundary Routers (ASBRs): Routers connected to an another AS and the routers in which external routes are redistributed. OSPF Administrative Distance Values For Best Path selection, Administrative Distance (Preference) values are very important. Every Routing Protocol has an AD value. The Administrative Distance (Preference) of the Open Shortest Path First is 110 for Cisco devices. This is a little different for Alcatel-Lucent, Huawei and Juniper devices. They use Interneal and External Preference values for Open Shortest Path First. Preference value is 10 for Internal OSPF Routes and 150 for External OSPF Routes on the devices of these vendors. Router ID Router ID is an important term for Open Shortest Path First Operations. Every router has to have a unique Router ID in the Open Shortest Path First Topology. So, generally Router ID is manually configured on all OSPF Routers. If this is not done, the highest interface IP address is selected as Router ID. Open Shortest Path First Cost Open Shortest Path First uses path Cost as its metric. Generally Bandwidth value is used as path Cost. AS a formula, the Cost is calculated like below in OSPF: Cost = Reference BW(default 10 000 000) / BW OSPF Versions Protocols are developed and then they enhanced with new features. This new enhanced versions came with new versions. Open Shortest Path First also has different versions. There are two OSFP versions. These are: OSPFv2 OSPFv3 OSPFv2 is the first version of Open Shortest Path First and it is used with IPv4. OSPFv3 is the enhanced version of OSPFv2 that supports and designed for IPv6. In the below table, you can check the differences of these two versions as summary. In this article, we have talked about an overview of OSPFv2. In the following articles, we will explain this lesson more deeply. If you want to learn more about OSPFv3, you can check IPv6 Routing Protocols lesson. Become a Member! Lesson tags: ospfv2, ospf, routing Back to: JNCIE > OSPF Leave a Reply Cancel replyYour email address will not be published. Required fields are marked *Name * Email * Website Comment * Δ Previous Next Collapse Expand IPv6 IPv6 Configuration Example on Juniper IPv6 Address Types IPv6 Header versus IPv4 Header OSPF OSPFv2 Configuration on Juniper OSPF (Open Shortest Path First) OSPF Packet Types OSPF Adjacency OSPF Area Types OSPF LSA Types OSPF Network Types OSPF Other Key Lessons OSPFv3 Overview WAN Metro Ethernet BGP Border Gateway Protocol IBGP versus EBGP BGP Next Hop Self on Juniper Path Attributes of BGP BGP Messages, BGP Peers and BGP Sessions BGP Path Attributes: MED BGP Path Attributes: Origin BGP Path Attributes: AS Path BGP Path Attributes : Local Preference BGP Configuration Example on Juniper IS-IS ISIS Configuration on Juniper IS-IS Adjacency IS-IS Packet Types IS-IS Addresses Intermediate System to Intermediate System Protocol IS-IS versus OSPF Security RADIUS Overview Dynamic ARP Inspection Juniper Configuration TACACS+ Overview AAA AAA Protocols MPLS LDP Label Distribution MPLS Fundamentals MPLS Label Switching Operation RSVP-TE Label Distribution Protocol, LDP DHCP, DNS, NAT NAT DNS DHCP IP Allocation Operation DHCP High Availability LACP Configuration on Juniper BFD (Bidirectional Forwarding Detection) SNMP Configuration On Juniper Link Aggregation with LACP SNMP VRRP IP Multicast MLD (Multicast Listener Discovery) MLD Operations IGMP IGMP Snooping Multicast IP Addresses Multicast MAC Addresses Ethernet Switching and STP Network Cabling Local Area Networks (LAN) Ethernet Switches How STP Works? Rapid Spanning Tree Protocol Spanning Tree Protocol VPN Layer 2 VPN (VPLS) Overview Layer 2 VPN (VPLS) Topologies Layer 2 VPN (VPLS) MAC Learning Layer 3 VPN Overview Layer 3 VPN Operations Layer 3 VPN Data Plane MPLS VPN Labelling Basic Routing RIP Configuration on Juniper Dynamic Routing Protocols Routing Tables of Juniper Routers IPv6 Static Routing Example On Juniper IPv4 Static Routing Example on Juniper ARP and ICMP ARP Proxy ARP Gratuitous ARP ICMP Important Terms What is CIR and PIR? SearchSearchLatest Lessons Cloud Computing Basics Part of: CCNA 200-301 v1.1 OSPF vs BGP Part of: CCNP Enterprise 350-401 ENCOR v1.1 Binary, Hex and Decimal Conversion Part of: CCNA 200-301 v1.1 SSID Meaning Part of: CCNA 200-301 v1.1 Cisco Telnet Configuration: IPv4 And IPv6 Part of: CCNA 200-301 v1.1 Telnet Part of: CCNA 200-301 v1.1 CIDR and CIDR Calculation Part of: CCNA 200-301 v1.1 Basic Huawei Configuration Example Part of: Huawei Configuration Course Basic Huawei Configuration Part of: HCIA-Datacom (HCNA) Real Life Subnetting Example Part of: CCNA 200-301 v1.1 More Lessons Latest Blog Posts Cisco Interview Questions 30 Jun, 2025 Network Operating System 14 Mar, 2025 SFP 22 Oct, 2024 CCNA Minor Update! | CCNA 200-301 v1.1 9 Jul, 2024 Cisco Packet Tracer Overview 26 Jun, 2024 WHAT YOU WILL FIND? 250.000+ Students All Over The World 8.000+ Questions & Answers 100+ Lab Files & Cheat Sheets 30+ IT/Network Courses A Real Desire To Help You Daily Social Media Shares %100 Satisfaction COURSES CISCO Courses NOKIA Courses HUAWEI Courses JUNIPER Courses PYTHON Course KEY Courses VIDEO Courses UDEMY Courses SPECIALS All Quizes Cheat Sheets Configuration Files Interview Questions IPCisco On Social Media MEMBERSHIP Membership CONTACT Pärnu mnt. 139c – 14, 11317, Tallinn, Estonia info@ipcisco.com Copyright © 2018-2024 IPCisco Disclaimer Privacy Policy Distance Selling Contract",
    "source_url": "https://ipcisco.com/lesson/ospf-open-shortest-path-first/",
    "quality_score": 95,
    "confidence": 90,
    "expert_level": "advanced",
    "scraped_from": "IPcisco_OSPF",
    "created_at": "2025-09-04T01:46:17.906326"
  },
  {
    "case_id": "EXPERT_SEC_003",
    "title": "Expert Knowledge: OWASP Top Ten | OWASP Foundation",
    "category": "Web Security",
    "technology": "OWASP Standards",
    "description": "OWASP Top Ten Important note: OWASP Top Ten 2025 Current project status as of July 2025: We are on track to announce the release of the OWASP Top 10:2025 in the late summer/early fall 2025. Stay Tuned! The OWASP Top 10 is a standard awareness document for developers and web application security. It represents a broad consensus about the most critical security risks to web applications. Globally recognized by developers as the first step towards more secure coding. Companies should adopt this doc...",
    "full_content": "OWASP Top Ten Important note: OWASP Top Ten 2025 Current project status as of July 2025: We are on track to announce the release of the OWASP Top 10:2025 in the late summer/early fall 2025. Stay Tuned! The OWASP Top 10 is a standard awareness document for developers and web application security. It represents a broad consensus about the most critical security risks to web applications. Globally recognized by developers as the first step towards more secure coding. Companies should adopt this document and start the process of ensuring that their web applications minimize these risks. Using the OWASP Top 10 is perhaps the most effective first step towards changing the software development culture within your organization into one that produces more secure code. Top 10 Web Application Security Risks There are three new categories, four categories with naming and scoping changes, and some consolidation in the Top 10 for 2021. A01:2021-Broken Access Control moves up from the fifth position; 94% of applications were tested for some form of broken access control. The 34 Common Weakness Enumerations (CWEs) mapped to Broken Access Control had more occurrences in applications than any other category. A02:2021-Cryptographic Failures shifts up one position to #2, previously known as Sensitive Data Exposure, which was broad symptom rather than a root cause. The renewed focus here is on failures related to cryptography which often leads to sensitive data exposure or system compromise. A03:2021-Injection slides down to the third position. 94% of the applications were tested for some form of injection, and the 33 CWEs mapped into this category have the second most occurrences in applications. Cross-site Scripting is now part of this category in this edition. A04:2021-Insecure Design is a new category for 2021, with a focus on risks related to design flaws. If we genuinely want to “move left” as an industry, it calls for more use of threat modeling, secure design patterns and principles, and reference architectures. A05:2021-Security Misconfiguration moves up from #6 in the previous edition; 90% of applications were tested for some form of misconfiguration. With more shifts into highly configurable software, it’s not surprising to see this category move up. The former category for XML External Entities (XXE) is now part of this category. A06:2021-Vulnerable and Outdated Components was previously titled Using Components with Known Vulnerabilities and is #2 in the Top 10 community survey, but also had enough data to make the Top 10 via data analysis. This category moves up from #9 in 2017 and is a known issue that we struggle to test and assess risk. It is the only category not to have any Common Vulnerability and Exposures (CVEs) mapped to the included CWEs, so a default exploit and impact weights of 5.0 are factored into their scores. A07:2021-Identification and Authentication Failures was previously Broken Authentication and is sliding down from the second position, and now includes CWEs that are more related to identification failures. This category is still an integral part of the Top 10, but the increased availability of standardized frameworks seems to be helping. A08:2021-Software and Data Integrity Failures is a new category for 2021, focusing on making assumptions related to software updates, critical data, and CI/CD pipelines without verifying integrity. One of the highest weighted impacts from Common Vulnerability and Exposures/Common Vulnerability Scoring System (CVE/CVSS) data mapped to the 10 CWEs in this category. Insecure Deserialization from 2017 is now a part of this larger category. A09:2021-Security Logging and Monitoring Failures was previously Insufficient Logging & Monitoring and is added from the industry survey (#3), moving up from #10 previously. This category is expanded to include more types of failures, is challenging to test for, and isn’t well represented in the CVE/CVSS data. However, failures in this category can directly impact visibility, incident alerting, and forensics. A10:2021-Server-Side Request Forgery is added from the Top 10 community survey (#1). The data shows a relatively low incidence rate with above average testing coverage, along with above-average ratings for Exploit and Impact potential. This category represents the scenario where the security community members are telling us this is important, even though it’s not illustrated in the data at this time. Translation Efforts Efforts have been made in numerous languages to translate the OWASP Top 10 - 2021. If you are interested in helping, please contact the members of the team for the language you are interested in contributing to, or if you don’t see your language listed (neither here nor at github), please email [email protected] to let us know that you want to help and we’ll form a volunteer group for your language. We have compiled this readme with some hints to help you with your translation. Top10:2021 Completed Translations: ar - العربية es - Español fr - Français id - Indonesian it - Italiano ja - 日本語] pt_BR - Português (Brasil) zh_CN - 简体中文 zh_TW - 繁體中文 Historic: Top10:2017 Completed Translations: Chinese: OWASP Top 10-2017 - 中文版（PDF) 项目组长：王颉（[email protected]） 翻译人员：陈亮、王厚奎、王颉、王文君、王晓飞、吴楠、徐瑞祝、夏天泽、杨璐、张剑钟、赵学文（排名不分先后，按姓氏拼音排列） 审查人员：Rip、包悦忠、李旭勤、杨天识、张家银（排名不分先后，按姓氏拼音排列） 汇编人员：赵学文 French: OWASP Top 10 2017 in French (Git/Markdown) German: OWASP Top 10 2017 in German V1.0 (Pdf) (web pages)compiled by Christian Dresen, Alexios Fakos, Louisa Frick, Torsten Gigler, Tobias Glemser, Dr. Frank Gut, Dr. Ingo Hanke, Dr. Thomas Herzog, Dr. Markus Koegel, Sebastian Klipper, Jens Liebau, Ralf Reinhardt, Martin Riedel, Michael Schaefer Hebrew: OWASP Top 10-2017 - Hebrew (PDF) (PPTX)translated by Eyal Estrin (Twitter: @eyalestrin) and Omer Levi Hevroni (Twitter: @omerlh). Japanese: OWASP Top 10-2017 - 日本語版 (PDF) translated and reviewed by Akitsugu ITO, Albert Hsieh, Chie TAZAWA, Hideko IGARASHI, Hiroshi TOKUMARU, Naoto KATSUMI, Riotaro OKADA, Robert DRACEA, Satoru TAKAHASHI, Sen UENO, Shoichi NAKATA, Takanori NAKANOWATARI ,Takanori ANDO, Tomohiro SANAE. Korean: OWASP Top 10-2017 - 한글 (PDF) (PPTX) 번역 프로젝트 관리 및 감수 : 박형근(Hyungkeun Park) / 감수(ㄱㄴㄷ순) : 강용석(YongSeok Kang), 박창렴(Park Changryum), 조민재(Johnny Cho) / 편집 및 감수 : 신상원(Shin Sangwon) / 번역(ㄱㄴㄷ순) : 김영하(Youngha Kim), 박상영(Sangyoung Park), 이민욱(MinWook Lee), 정초아(JUNG CHOAH), 조광렬(CHO KWANG YULL), 최한동(Handong Choi) Portuguese: OWASP Top 10 2017 - Portuguese (PDF) (ODP) translated by Anabela Nogueira, Carlos Serrão, Guillaume Lopes, João Pinto, João Samouco, Kembolle A. Oliveira, Paulo A. Silva, Ricardo Mourato, Rui Silva, Sérgio Domingues, Tiago Reis, Vítor Magano. Russian: OWASP Top 10-2017 - на русском языке (PDF) translated and reviewed by JZDLin (@JZDLin), Oleksii Skachkov (@hamster4n), Ivan Kochurkin (@KvanTTT) and Taras Ivashchenko Spanish: OWASP Top 10-2017 - Español (PDF) Gerardo Canedo（[email protected] - [Twitter: @GerardoMCanedo]) Cristian Borghello（[email protected] - [Twitter: @seguinfo]) Top10:2017 Release Candidate Translation Teams: Azerbaijanian: Rashad Aliyev ([email protected]) Chinese RC2:Rip、包悦忠、李旭勤、王颉、王厚奎、吴楠、徐瑞祝、夏天泽、张家银、张剑钟、赵学文(排名不分先后，按姓氏拼音排列) OWASP Top10 2017 RC2 - Chinese PDF French: Ludovic Petit: [email protected], Sébastien Gioria: [email protected]. Others to be listed. Top10:2013 Completed Translations: Arabic: OWASP Top 10 2013 - Arabic PDFTranslated by: Mohannad Shahat: [email protected], Fahad: @SecurityArk, Abdulellah Alsaheel: [email protected], Khalifa Alshamsi: [email protected] and Sabri(KING SABRI): [email protected], Mohammed Aldossary: [email protected] Chinese 2013：中文版2013 OWASP Top 10 2013 - Chinese (PDF).项目组长： Rip、王颉， 参与人员： 陈亮、 顾庆林、 胡晓斌、 李建蒙、 王文君、 杨天识、 张在峰 Czech 2013: OWASP Top 10 2013 - Czech (PDF) OWASP Top 10 2013 - Czech (PPTX)CSIRT.CZ - CZ.NIC, z.s.p.o. (.cz domain registry): Petr Zavodsky: [email protected], Vaclav Klimes, Zuzana Duracinska, Michal Prokop, Edvard Rejthar, Pavel Basta French 2013: OWASP Top 10 2013 - French PDFLudovic Petit: [email protected], Sébastien Gioria: [email protected], Erwan Abgrall: [email protected], Benjamin Avet: [email protected], Jocelyn Aubert: [email protected], Damien Azambour: [email protected], Aline Barthelemy: [email protected], Moulay Abdsamad Belghiti: [email protected], Gregory Blanc: [email protected], Clément Capel: [email protected], Etienne Capgras: [email protected], Julien Cayssol: [email protected], Antonio Fontes: [email protected], Ely de Travieso: [email protected], Nicolas Grégoire: [email protected], Valérie Lasserre: [email protected], Antoine Laureau: [email protected], Guillaume Lopes: [email protected], Gilles Morain: [email protected], Christophe Pekar: [email protected], Olivier Perret: [email protected], Michel Prunet: [email protected], Olivier Revollat: [email protected], Aymeric Tabourin: [email protected] German 2013: OWASP Top 10 2013 - German PDF[email protected] which is Frank Dölitzscher, Torsten Gigler, Tobias Glemser, Dr. Ingo Hanke, Thomas Herzog, Kai Jendrian, Ralf Reinhardt, Michael Schäfer Hebrew 2013: OWASP Top 10 2013 - Hebrew PDFTranslated by: Or Katz, Eyal Estrin, Oran Yitzhak, Dan Peled, Shay Sivan. Italian 2013: OWASP Top 10 2013 - Italian PDFTranslated by: Michele Saporito: [email protected], Paolo Perego: [email protected], Matteo Meucci: [email protected], Sara Gallo: [email protected], Alessandro Guido: [email protected], Mirko Guido Spezie: [email protected], Giuseppe Di Cesare: [email protected], Paco Schiaffella: [email protected], Gianluca Grasso: [email protected], Alessio D’Ospina: [email protected], Loredana Mancini: [email protected], Alessio Petracca: [email protected], Giuseppe Trotta: [email protected], Simone Onofri: [email protected], Francesco Cossu: [email protected], Marco Lancini: [email protected], Stefano Zanero: [email protected], Giovanni Schmid: [email protected], Igor Falcomata’: [email protected] Japanese 2013: OWASP Top 10 2013 - Japanese PDFTranslated by: Chia-Lung Hsieh: ryusuke.tw(at)gmail.com, Reviewed by: Hiroshi Tokumaru, Takanori Nakanowatari Korean 2013: OWASP Top 10 2013 - Korean PDF (이름가나다순)김병효:[email protected], 김지원:[email protected], 김효근:[email protected], 박정훈:[email protected], 성영모:[email protected], 성윤기:[email protected], 송보영:[email protected], 송창기:[email protected], 유정호:[email protected], 장상민:[email protected], 전영재:[email protected], 정가람:[email protected], 정홍순:[email protected], 조민재:[email protected],허성무:[email protected] Brazilian Portuguese 2013: OWASP Top 10 2013 - Brazilian Portuguese PDFTranslated by: Carlos Serrão, Marcio Machry, Ícaro Evangelista de Torres, Carlo Marcelo Revoredo da Silva, Luiz Vieira, Suely Ramalho de Mello, Jorge Olímpia, Daniel Quintão, Mauro Risonho de Paula Assumpção, Marcelo Lopes, Caio Dias, Rodrigo Gularte Spanish 2013: OWASP Top 10 2013 - Spanish PDFGerardo Canedo: [email protected], Jorge Correa: [email protected], Fabien Spychiger: [email protected], Alberto Hill: [email protected], Johnatan Stanley: [email protected], Maximiliano Alonzo: [email protected], Mateo Martinez: [email protected], David Montero: [email protected], Rodrigo Martinez: [email protected], Guillermo Skrilec: [email protected], Felipe Zipitria: [email protected], Fabien Spychiger: [email protected], Rafael Gil: [email protected], Christian Lopez: [email protected], jonathan fernandez [email protected], Paola Rodriguez: [email protected], Hector Aguirre: [email protected], Roger Carhuatocto: [email protected], Juan Carlos Calderon: [email protected], Marc Rivero López: [email protected], Carlos Allendes: [email protected], [email protected]: [email protected], Manuel Ramírez: [email protected], Marco Miranda: [email protected], Mauricio D. Papaleo Mayada: [email protected], Felipe Sanchez: [email protected], Juan Manuel Bahamonde: [email protected], Adrià Massanet: [email protected], Jorge Correa: [email protected], Ramiro Pulgar: [email protected], German Alonso Suárez Guerrero: [email protected], Jose A. Guasch: [email protected], Edgar Salazar: [email protected] Ukrainian 2013: OWASP Top 10 2013 - Ukrainian PDFKateryna Ovechenko, Yuriy Fedko, Gleb Paharenko, Yevgeniya Maskayeva, Sergiy Shabashkevich, Bohdan Serednytsky 2010 Completed Translations: Korean 2010: OWASP Top 10 2010 - Korean PDFHyungkeun Park, ([email protected]) Spanish 2010: OWASP Top 10 2010 - Spanish PDF Daniel Cabezas Molina, Edgar Sanchez, Juan Carlos Calderon, Jose Antonio Guasch, Paulo Coronado, Rodrigo Marcos, Vicente Aguilera French 2010: OWASP Top 10 2010 - French PDF[email protected], [email protected], [email protected], [email protected], [email protected], [email protected], [email protected] German 2010: OWASP Top 10 2010 - German PDF[email protected] which is Frank Dölitzscher, Tobias Glemser, Dr. Ingo Hanke, Kai Jendrian, Ralf Reinhardt, Michael Schäfer Indonesian 2010: OWASP Top 10 2010 - Indonesian PDFTedi Heriyanto (coordinator), Lathifah Arief, Tri A Sundara, Zaki Akhmad Italian 2010: OWASP Top 10 2010 - Italian PDFSimone Onofri, Paolo Perego, Massimo Biagiotti, Edoardo Viscosi, Salvatore Fiorillo, Roberto Battistoni, Loredana Mancini, Michele Nesta, Paco Schiaffella, Lucilla Mancini, Gerardo Di Giacomo, Valentino Squilloni Japanese 2010: OWASP Top 10 2010 - Japanese PDF[email protected], Dr. Masayuki Hisada, Yoshimasa Kawamoto, Ryusuke Sakamoto, Keisuke Seki, Shin Umemoto, Takashi Arima Chinese 2010: OWASP Top 10 2010 - Chinese PDF感谢以下为中文版本做出贡献的翻译人员和审核人员: Rip Torn, 钟卫林, 高雯, 王颉, 于振东 Vietnamese 2010: OWASP Top 10 2010 - Vietnamese PDFTranslation lead by Cecil Su - Translation Team: Dang Hoang Vu, Nguyen Ba Tien, Nguyen Tang Hung, Luong Dieu Phuong, Huynh Thien Tam Hebrew 2010: OWASP Top 10 Hebrew Project – OWASP Top 10 2010 - Hebrew PDF.Lead by Or Katz, see translation page for list of contributors. 2021 Project Sponsors The OWASP Top 10:2021 is sponsored by Secure Code Warrior. 2017 Project Sponsors The OWASP Top 10 - 2017 project was sponsored by Autodesk, and supported by the OWASP NoVA Chapter. 2003-2013 Project Sponsors Thanks to Aspect Security for sponsoring earlier versions. OWASP Top 10 2025 Data Analysis Plan Goals To collect the most comprehensive dataset related to identified application vulnerabilities to-date to enable analysis for the Top 10 and other future research as well. This data should come from a variety of sources; security vendors and consultancies, bug bounties, along with company/organizational contributions. Data will be normalized to allow for level comparison between Human assisted Tooling and Tooling assisted Humans. Analysis Infrastructure Plan to leverage the OWASP Azure Cloud Infrastructure to collect, analyze, and store the data contributed. Contributions We plan to support both known and pseudo-anonymous contributions. The preference is for contributions to be known; this immensely helps with the validation/quality/confidence of the data submitted. If the submitter prefers to have their data stored anonymously and even go as far as submitting the data anonymously, then it will have to be classified as “unverified” vs. “verified”. Verified Data Contribution Scenario 1: The submitter is known and has agreed to be identified as a contributing party. Scenario 2: The submitter is known but would rather not be publicly identified. Scenario 3: The submitter is known but does not want it recorded in the dataset. Unverified Data Contribution Scenario 4: The submitter is anonymous. (Should we support?) The analysis of the data will be conducted with a careful distinction when the unverified data is part of the dataset that was analyzed. Contribution Process There are a few ways that data can be contributed: Email a CSV/Excel file with the dataset(s) to [email protected] Upload a CSV/Excel file to https://bit.ly/OWASPTop10Data Template examples can be found in GitHub: https://github.com/OWASP/Top10/tree/master/2025/Data Contribution Period We plan to accept contributions to the new Top 10 until July 31, 2025, for data dating from 2021 to 2024. Data Structure The following data elements are required or optional. The more information provided the more accurate our analysis can be. At a bare minimum, we need the time period, total number of applications tested in the dataset, and the list of CWEs and counts of how many applications contained that CWE. If at all possible, please provide the additional metadata, because that will greatly help us gain more insights into the current state of testing and vulnerabilities. Metadata Contributor Name (org or anon) Contributor Contact Email Time period (2024, 2023, 2022, 2021) Number of applications tested Type of testing (TaH, HaT, Tools) Primary Language (code) Geographic Region (Global, North America, EU, Asia, other) Primary Industry (Multiple, Financial, Industrial, Software, ??) Whether or not data contains retests or the same applications multiple times (T/F) CWE Data A list of CWEs w/ count of applications found to contain that CWE If at all possible, please provide core CWEs in the data, not CWE categories. This will help with the analysis, any normalization/aggregation done as a part of this analysis will be well documented. Note: If a contributor has two types of datasets, one from HaT and one from TaH sources, then it is recommended to submit them as two separate datasets. HaT = Human assisted Tools (higher volume/frequency, primarily from tooling) TaH = Tool assisted Human (lower volume/frequency, primarily from human testing) Survey Similarly to the Top Ten 2021, we plan to conduct a survey to identify up to two categories of the Top Ten that the community believes are important, but may not be reflected in the data yet. We plan to conduct the survey in early 2025, and will be utilizing Google forms in a similar manner as last time. The CWEs on the survey will come from current trending findings, CWEs that are outside the Top Ten in data, and other potential sources. Process At a high level, we plan to perform a level of data normalization; however, we will keep a version of the raw data contributed for future analysis. We will analyze the CWE distribution of the datasets and potentially reclassify some CWEs to consolidate them into larger buckets. We will carefully document all normalization actions taken so it is clear what has been done. We plan to calculate likelihood following the model we continued in 2021 to determine incidence rate instead of frequency to rate how likely a given app may contain at least one instance of a CWE. This means we aren’t looking for the frequency rate (number of findings) in an app, rather, we are looking for the number of applications that had one or more instances of a CWE. We can calculate the incidence rate based on the total number of applications tested in the dataset compared to how many applications each CWE was found in. In addition, we will be developing base CWSS scores for the top 20-30 CWEs and include potential impact into the Top 10 weighting. Also, would like to explore additional insights that could be gleaned from the contributed dataset to see what else can be learned that could be of use to the security and development communities. Watch Star The OWASP® Foundation works to improve the security of software through its community-led open source software projects, hundreds of chapters worldwide, tens of thousands of members, and by hosting local and global conferences. Project Information • OWASP Top 10:2021 • Making of OWASP Top 10 • OWASP Top 10:2021 - 20th Anniversary Presentation (PPTX) Flagship Project Documentation Builder Defender • Previous Version (2017) Downloads or Social Links • OWASP Top 10 2017 • Other languages → tab ‘Translation Efforts’ Social Twitter Code Repository repo Leaders Andrew van der Stock Brian Glas Neil Smithline Torsten Gigler Upcoming OWASP Global Events",
    "source_url": "https://owasp.org/www-project-top-ten/",
    "quality_score": 96,
    "confidence": 92,
    "expert_level": "expert",
    "scraped_from": "OWASP_Top10",
    "created_at": "2025-09-04T01:46:17.906430"
  },
  {
    "case_id": "EXPERT_SEC_004",
    "title": "Expert Knowledge: Tactics - Enterprise | MITRE ATT&CK®",
    "category": "Threat Intelligence",
    "technology": "MITRE ATT&CK Framework",
    "description": "ATT&CKcon 6.0 is coming October 14-15 in McLean, VA and live online. Tickets are available now! Home Tactics Enterprise Enterprise tactics Tactics represent the \"why\" of an ATT&CK technique or sub-technique. It is the adversary's tactical goal: the reason for performing an action. For example, an adversary may want to achieve credential access. Enterprise Tactics: 14 ID Name Description TA0043 Reconnaissance The adversary is trying to gather information they can use to plan future operations. TA...",
    "full_content": "ATT&CKcon 6.0 is coming October 14-15 in McLean, VA and live online. Tickets are available now! Home Tactics Enterprise Enterprise tactics Tactics represent the \"why\" of an ATT&CK technique or sub-technique. It is the adversary's tactical goal: the reason for performing an action. For example, an adversary may want to achieve credential access. Enterprise Tactics: 14 ID Name Description TA0043 Reconnaissance The adversary is trying to gather information they can use to plan future operations. TA0042 Resource Development The adversary is trying to establish resources they can use to support operations. TA0001 Initial Access The adversary is trying to get into your network. TA0002 Execution The adversary is trying to run malicious code. TA0003 Persistence The adversary is trying to maintain their foothold. TA0004 Privilege Escalation The adversary is trying to gain higher-level permissions. TA0005 Defense Evasion The adversary is trying to avoid being detected. TA0006 Credential Access The adversary is trying to steal account names and passwords. TA0007 Discovery The adversary is trying to figure out your environment. TA0008 Lateral Movement The adversary is trying to move through your environment. TA0009 Collection The adversary is trying to gather data of interest to their goal. TA0011 Command and Control The adversary is trying to communicate with compromised systems to control them. TA0010 Exfiltration The adversary is trying to steal data. TA0040 Impact The adversary is trying to manipulate, interrupt, or destroy your systems and data. × load more results",
    "source_url": "https://attack.mitre.org/tactics/enterprise/",
    "quality_score": 96,
    "confidence": 92,
    "expert_level": "expert",
    "scraped_from": "MITRE_ATT&CK_Tactics",
    "created_at": "2025-09-04T01:46:17.906447"
  }
]